plantalog/cadi-gcl/stm32f100/current/main.c
/*
 *  Use this code free of charge, but leave this text box here, 
 *  This code is distributed as is with no warranties.
 *  https://github.com/plantalog/ is main repository hub for Cadi project.
 *
 *	27.08.2013 changed the virtaddvartab usage to copying the whole row or variables 0x05C0-0x0679
 *
 *
 */

#include "stm32f10x_it.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_tim.h"
#include "misc.h"
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_dma.h"
#include "stm32f10x_exti.h"
#include "stm32f10x_conf.h"
#include "stm32f10x_usart.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "stm32f10x_flash.h"
#include "eeprom.h"
#include "ff9a/src/diskio.h"
#include "ff9a/src/ff.h"
#include "driver_sonar.h"


// enabling test mode adds some test functionality
#define	TEST_MODE

#define TANK_STAB_ENABLE

// SENSOR AND CONTROL DEVICES DRIVERS
/*
 * Peripherals used with Cadi should be properly initialized before use.
 * Typical init has:
 * - Pin config (except integrated peripherals like RTC or Flash)
 * - Driver variable's pool definitions
 * - #defines for names used
 * Some drivers need interfacing and/or data processing functions to
 * be implemented
 */


// DRIVER: WATER FLOW METER
#define USE_WFM
#ifdef USE_WFM		//	START WFM DEFINITIONS
#define WFM_AMOUNT	4	// number of meters to work with
uint32_t water_counter[WFM_AMOUNT];
#define WFM_PINS_PB0_1	// WFM assigned to pins PB0 and PB1
#endif				//	EOF WFM DEFINITIONS


// DRIVER: Spherical valves with feedback
#define USE_VALVES
#ifdef USE_VALVES	// START VALVES DEFINITIONS
#define VALVE_DISABLE	GPIOA->BSRR
#define VALVE_ENABLE	GPIOA->BRR
#define VALVE_SENSOR_GPIO_SHIFT		5		// valve position sensor GPIO shift
#define VALVE_AMOUNT				3		// number of valves to process
#define VALVE_MOTOR_GPIO_SHIFT		11		// valve control motor GPIO out shift
#define VALVE_MOTOR_PORT			GPIOA
#define VALVE_SENSOR_PORT			GPIOA
#define VALVE_SENSOR_PORT_SOURCE	GPIO_PortSourceGPIOA
#define V1_SENSOR_PIN				GPIO_Pin_5
#define V2_SENSOR_PIN				GPIO_Pin_6
#define V3_SENSOR_PIN				GPIO_Pin_7
#define	VALVE_FAILURE_TIMEOUT		600	// timeout for valve open/close function to avoid hanging if valve broken
#define DRAIN_VALVE_ID				1
// Valve variables
uint8_t valveFlags;
uint8_t valve_failed;
#endif	// EOF VALVES DEFINITIONS


// DRIVER: Bluetooth module HC-06 USART
#define USE_BLUETOOTH
#ifdef USE_BLUETOOTH		// START BLUETOOTH USART DEFINITIONS
#define BT_USART	USART1
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define USARTx_IRQHandler   USART1_IRQHandler
//#define TxBufferSize   (countof(TxBuffer) - 1)
//#define RxBufferSize   0x10

/* Private macro -------------------------------------------------------------*/
#define countof(a)   (sizeof(a) / sizeof(*(a)))

/* Private variables ---------------------------------------------------------*/
// uint8_t TxBuffer[] = "\n\rCadi sends HELLO!\n\r";
uint8_t RxBuffer[10];
uint8_t RxByte;
uint8_t TxByte;
uint8_t comm_state=48;	// communication state
uint8_t TxDataReady;
uint8_t RxDataReady;
// uint8_t RxDataReady;
//uint8_t NbrOfDataToTransfer = TxBufferSize;
//uint8_t NbrOfDataToRead = RxBufferSize;
uint8_t TxCounter = 0;
uint16_t RxCounter = 0;
uint8_t logstr_crc=0;
#endif				// EOF BLUETOOTH USART DEFINITIONS


// DRIVER: Digital Temperature and Humidity sensor DHT22
#define USE_DHT
#ifdef USE_DHT			// START DHT DEFINITIONS
#define DHT_TRIG_PLUG			15		// PB15
#define DHT_DATA_START_POINTER	4		// DHT22 = 4, DHT11 = ?; sets the first bit number in captured sequence of DHT response bits
#define DHT_0					(GPIOB->BRR = (1<<DHT_TRIG_PLUG))
#define DHT_1					(GPIOB->BSRR = (1<<DHT_TRIG_PLUG))
typedef struct
{
  uint16_t 			DHT_Temperature;        // temperature
  uint16_t 			DHT_Humidity;  // from 0 (0%) to 1000 (100%)
  uint8_t 			DHT_CRC;  // from 0 (0%) to 1000 (100%)
}DHT_data;
__IO uint16_t IC2Value = 0;
__IO uint16_t DutyCycle = 0;
__IO uint32_t Frequency = 0;
TIM_ICInitTypeDef  TIM_ICInitStructure;
// digital humidity and temperature data
uint8_t dht_bit_array[50];
DHT_data DHTValue;
uint8_t		dht_data[5];
uint8_t dht_bit_position = 0;
uint8_t dht_bit_ready = 0;
uint8_t		dht_data_ready = 0;
uint8_t 	dht_rh_str[4], dht_t_str[4];
uint16_t	capture1=0, capture2=0;
volatile uint8_t capture_is_first = 1, capture_is_ready = 0;
uint16_t rhWindowTop, rhWindowBottom;
uint8_t rhUnderOver = 0;
#endif						// EOF DHT DEFINITIONS


// DRIVER: HD44780/1602 LCD module
#define USE_LCD
#ifdef USE_LCD				// START LCD DEFINITIONS
#define lcd_shift	11				// seems to be not used here anymore?
#define use_gpio	GPIO_Pin_13		// last data pin number
#define pin_d7		use_gpio		// define pins from last
#define pin_d6		use_gpio>>1
#define pin_d5		use_gpio>>2
#define pin_d4		use_gpio>>3		// to d4 of 4bit bus of 1602 LCD




// #define PAPA_EDITION
#ifdef PAPA_EDITION
#define lcd_init_port_data			RCC_APB2Periph_GPIOB
#define lcd_init_port_cmd			RCC_APB2Periph_GPIOB
#define pin_e 					GPIO_Pin_7
#define pin_rw					GPIO_Pin_8
#define pin_rs					GPIO_Pin_9
#define lcd_port_data			GPIOB
#define lcd_port_cmd			GPIOB
#endif

#ifndef PAPA_EDITION
#define lcd_init_port_data			RCC_APB2Periph_GPIOB
#define lcd_init_port_cmd			RCC_APB2Periph_GPIOC
#define pin_e 					GPIO_Pin_10
#define pin_rw					GPIO_Pin_11
#define pin_rs					GPIO_Pin_12
#define lcd_port_data			GPIOB
#define lcd_port_cmd			GPIOC
#endif



#define Function_set 				0b00100000//4-bit,2 - line mode, 5*8 dots
#define Display_on_off_control		0b00001100/// display on,cursor off,blink off
#define Display_clear				0b00000001
#define Entry_mode_set				0b00000100//

#define rs_1	lcd_port_cmd->ODR |=  pin_rs
#define rs_0	lcd_port_cmd->ODR &=~ pin_rs
#define e_1 	lcd_port_cmd->ODR |=  pin_e
#define e_0		lcd_port_cmd->ODR &=~ pin_e
#define rw_1	lcd_port_cmd->ODR |=  pin_rw
#define rw_0	lcd_port_cmd->ODR &=~ pin_rw
u32 del;
static uint8_t		LCDLine1[16], LCDLine2[16];		// lcd frame buffer
uint8_t lcd_pointerx=0, lcd_pointery=0;
#endif 						// EOF LCD DEFINITIONS


