plantalog/cadi-gcl/stm32f100/current/main.c
// DRIVER: Analog buttons
#define USE_BUTTONS
#ifdef USE_BUTTONS			// START BUTTONS DEFINITIONS
#define BUTTON_OK				2
#define BUTTON_CNL				3
#define BUTTON_BCK				1
#define BUTTON_FWD				4
#define BUTTON_RANGE_SHRINKER	0
#define JDR_BUTTONS	ADC1->JDR4		// continuous ADC channel for buttons
uint16_t button_ranges[8];	// 0,2,4,6 - lower, 1,3,5,7 - higher values for buttons
uint8_t buttonReverse=0;
#endif						// EOF BUTTONS DEFINITIONS



// DRIVER:  RTC
#define USE_RTC
#ifdef USE_RTC				// START RTC DEFINITIONS
#define YEAR12SECS		1325462400	// vse raschety vedjom ot 01.01.2012
typedef struct
{
  unsigned char  hour;
  unsigned char  min;
  unsigned char  sec;
} RTC_Time;

typedef struct
{
  uint16_t  hour;
  uint16_t  min;
  uint16_t  sec;
  uint16_t  day;
  uint16_t  month;
  uint16_t  year;
  uint16_t  doy;	   //day of year

} RTC_DateTime;

RTC_Time toAdjust;
uint32_t timerStateFlags, cTimerStateFlags;
#endif						// EOF RTC DEFINITIONS


// DRIVER: LOAD TRIGGERING
#define USE_LOADS
#ifdef USE_LOADS			// START LOADS DEFINITIONS
#define PLUG_DISABLE	GPIOC->BSRR
#define PLUG_ENABLE		GPIOC->BRR
#define	PLUG_INVERT		0		// enable reverse plugStateSet
#define PLUG_AMOUNT		3
uint32_t plugStateFlags;
uint8_t plugSettings[PLUG_AMOUNT] = {0, 1, 2};	// PLUG_AMOUNT - number of plugs HARDCODE
// elementy massiva - nomera tajmerov, sootvetstvujushih Plug'am.
// 0 element - pervyj plug, 1 element - plug no 2, etc
#endif						// EOF LOADS DEFINITIONS


// DRIVER: SD-card on SPI interface with FatFS
#define USE_SD
#ifdef USE_SD
	int no_sd;
	FATFS   fs;       // file system variable to mount SD card
	uint16_t logInterval=0;
#endif

/*
 *   =====  END OF DRIVER SECTION =====
 */




// define eeprom cells for keeping user settings. memory map
#define EE_PLUG_SETTINGS	0x05FF	//	each plug one value (16 plugs in total, range 7FF-809)
#define EE_TIMER1_ON		0x05DA	// for 4 timers 36 (hex=24) values (range: 7DA-7FF)
#define EE_CTIMER_DURATION	0x05C0	// 2 values for duration of cTimer.
#define EE_CTIMER_INTERVAL	0x05C2	// and 2 for interval. For 5 timers 25 (hex=19) values 7C0-7D9
#define EE_TIMER_SIZE		9
#define EE_CTIMER_SIZE		5
#define PH4_ADDR			0x0600
#define PH7_ADDR			0x0601
#define PH_INTERVAL			0x0602		// pH measurement interval in milliseconds
#define PH_BUFF_SIZE		0x0603		// pH buffer size
#define PH_WINDOW_TOP		0x0604		// pH window top adc value
#define PH_WINDOW_BOTTOM	0x0605	// pH window bottom adc value
#define SD_LOG_INTERVAL		0x0609		// sd logging interval, seconds
#define BUTTON_RANGES_START_ADDR	0x060A	// button ranges (8 values in a row) [60A-611]

#define EC1413_ADDR			0x0606
#define EC0_ADDR			0x067E	// after FMPs

#define RH_WINDOW_TOP		0x0607		// pH window top adc value
#define RH_WINDOW_BOTTOM	0x0608	// pH window bottom adc value

#define CIRCULATION_PUMP_ID_ADDR	0x0899		// seems not to be used due to overriding with timerId=70


// WATERING PROGRAMS SETTINGS ADRESSES
#define WP_AMOUNT					3		// 3x16=48(hex=30) values (range: 613-643)
#define WP_SIZE						16		// size of block of settings data of watering program
#define WP_OFFSET					0x0613	// watering program settings offset
#define TOP_WATER_SENSOR_SHIFT		1		// water sensor address offset inside watering program
#define BOTTOM_WATER_SENSOR_SHIFT	2		// water sensor address offset inside watering program
#define WATER_FILL_TIMEOUT_SHIFT	3		// if no sensor reached timout for water tank fill valve
#define WP_DURATION_SHIFT			4		// ready solution watering duration
#define WP_INTERVAL_SHIFT			5		// 2x16bit variables for program execution interval
#define WP_START_TIME_SHIFT			7		// 2x16bit variables for program start time
#define WP_LAST_RUN_SHIFT			9		// 2x16bit last run of watering program
// #define WP_CIRCULATION_PUMP_PLUG_SHIFT		11		// circulation pump plug nr
#define WP_WATERING_PUMP_PLUG_ID	11
#define WP_ENABLE_SHIFT				12
#define WP_END_TIME_SHIFT			13
#define WP_DRAIN_DURATION_SHIFT		15



// 9x7=63 (hex=39) 0x0644 - 0x067D

#define FMP_PROGRAMS_AMOUNT			9

// Fertilizer Mixing Program adresses	()
#define FMP_OFFSET								0x0644
#define FMP_SIZE								7
#define FMP_DOSING_PUMP_ID_SHIFT				1
#define FMP_DOSING_TIME_SHIFT					2
#define FMP_CIRCULATION_MIXING_TIME_SHIFT		3
#define FMP_2_WP_ASSOC_SHIFT					4
#define FMP_TRIG_FREQUENCY_SHIFT				5
#define FMP_ENABLE								6

#define COMM_MONITOR_MODE		48
#define COMM_GET_SETTINGS		49
#define COMM_SET_SETTINGS		50
#define COMM_DIRECT_DRIVE		51
#define SETTINGS_PACKET_SIZE	200	// look NumbOfVar define in eeprom.h
#define SETTINGS_START_ADDR		0x05C0	// HARDCODED in eeprom.c look for this address

#define WATER_TANK_TOP			0x0622
#define WATER_TANK_BOTTOM		0x0632

#define WFM_CAL_OFFSET			0x0642


#define DAY						1
#define NIGHT					0

#define BSRRL					BSRR
#define BSRRH					BRR


#define LOG_SHIFT	1

// analog inputs
#define JDR_EC		ADC1->JDR3		// continuous ADC channel for EC
#define JDR_PH		ADC1->JDR2		// continuous ADC channel for pH


uint16_t tank_windows_top[1];
uint16_t tank_windows_bottom[1];

uint8_t log_inc=0;
char log_str[64];


uint8_t circulationPumpId;
ErrorStatus  HSEStartUpStatus;
FLASH_Status FlashStatus;
uint16_t VarValue = 0;
uint16_t ph_seven=0;
uint32_t ph0=0;
uint16_t ph4=0;
uint16_t ec1413 = 0, ec0 = 0;
int cdel=0;
uint16_t phBuffer[10];
uint16_t ecBuffer[10];
uint8_t curphstr[5];
uint8_t curecstr[5];
uint16_t phAdcValue;
uint16_t ecAdcValue;
uint8_t currentEc=0;
uint8_t currentPh=0;
uint8_t phUnderOver = 0;	// 0 - pH value is within window, 1 - under window, 2 - over window
uint8_t ecUnderOver = 0;	// 0 - pH value is within window, 1 - under window, 2 - over window
uint16_t phWindowTop, phWindowBottom;
uint16_t ecWindowTop, ecWindowBottom;
uint32_t lastWriteTime=0;
uint8_t lightSensor;
uint16_t lightRange;
uint8_t wpStateFlags;
uint8_t dosingPumpStateFlags;
uint8_t waterSensorStateFlags;
uint8_t wsl_buff[3];
uint8_t curculationPumpId;
uint16_t wfCalArray[WFM_AMOUNT];

void hygroStatSettings(void);
uint8_t readPercentVal(uint8_t value);
uint32_t measureDelay(void);
void phMonSettings(void);
void setTimer(uint8_t timerId);
void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos);
void Lcd_write_arr(uc8 *STRING, uint8_t chars);
void Lcd_write_digit(uint8_t numb);
void Delay_us(uint32_t delay);
void buttonCalibration(void);
void Init_pin_out(void);
void Init_pin_in(void);
void Init_lcd(void);
void Lcd_write_data(uint8_t byte);
void Lcd_write_cmd(uint8_t byte);
void Lcd_clear(void);
void Return_home(void);
void Lcd_goto(uc8 x, uc8 y);
void Lcd_write_str(char *STRING);
char* adc2str(uint_fast16_t d, char* out);
void int32str(uint32_t d, char *out);
void AdcInit(void);
uint32_t RTC_GetCounter(void);
void RTC_SetCounter(uint32_t value);
unsigned char RtcInit(void);
uint8_t readButtons(void);
void focusMenuItem(int itemId);
int menuSelector(void);
uint32_t timeAdjust(uint32_t cnt, uint8_t includeDays);
void programRunner(uint8_t programId);
RTC_DateTime unix2DateTime(uint32_t unixtime);
uint32_t DateTime2unix(RTC_DateTime datetime);
void EE_WriteWord(uint16_t Address, uint32_t Data);
uint32_t EE_ReadWord(uint16_t Address);
//void Lcd_print(char *STRING);
void setCTimer(uint8_t timerId);
uint32_t CTimerAdjust(uint32_t time);
void plugStateSet(uint8_t plug, uint8_t state);
void getPh();
FRESULT string2log(char* str, int bytes);
FRESULT sdLog2(void);
uint8_t adjust8bit(uint8_t val);
void loggerSettings(void);
int yesNoSelector(char str, int curval);
void loadSettings(void);
void set4lowBits(uint8_t dta);
void set4highBits(uint8_t dta);
void flush_lcd_buffer(void);
void phStabSettings(void);
void Lcd_write_16int(uint16_t);
void saveButtonRanges(void);
void readButtonRanges(void);
void set16bit(uint16_t value);
void convPh2str(uint8_t ph, char* phstr);
uint8_t readPhVal(uint8_t value);
void dht_conv_data(void);
void dht_init(void);
void dht_init_out(void);
void TIM3_IRQHandler(void);
void TIM1_BRK_TIM15_IRQHandler(void);
void dht_arr_displayer(void);
void setPwmDc(uint8_t duty_cycle);
void setDutyCycle(void);
void displayAdcValues(void);
uint16_t get_average_adc(uint8_t amount);
void EXTI0_IRQHandler(void);
void EXTI1_IRQHandler(void);

void water_program_setup(progId);
void fertilization_setup(void);
void watering_setup(void);
void fertilizer_mixing_program_setup(progId);
void run_watering_program(progId);
void run_fertilizer_mixer(progId);
// void calibratEc(void);
void startWp(void);
uint16_t adjust16bit_fast(uint16_t val, uint8_t speed);
char * utoa_fast_div(uint32_t value, char *buffer);


static void uart_task(void *pvParameters);
static void prvSetupHardware( void );
static void displayClock( void *pvParameters );
static void timerStateTrigger(void *pvParameters);
static void plugStateTrigger(void  *pvParameters);
static void sdLog(void  *pvParameters);
static void phMonitor(void  *pvParameters);
static void vTaskLCDdraw(void *pvParameters);
static void watering_program_trigger(void *pvParameters);
// static void valveManager(void);
static void valve_status_updater(void);
void bluetooth_init(void);
void display_usart_rx(void);

void open_valve(uint8_t valveId);
void close_valve(uint8_t valveId);
void run_valve_motor(uint8_t valveId);
void stop_valve_motor(uint8_t valveId);
void valve_test(void);
void valve_feedback_init(void);
void dosing_motor_control_init(void);
void valve_motor_control_init(void);
void EXTI15_10_IRQHandler(void);
void water_level_input_init(void);
void fertilizer_mixing_program_setup(progId);
uint16_t adjust16bit(uint16_t val);
void enable_dosing_pump(uint8_t pumpId, uint8_t state);
void valveMotorStateSet(uint8_t valveId, uint8_t state);
void USART1_IRQHandler(void);
void StartDMAChannel4(unsigned int LengthBufer);
unsigned char GetStateDMAChannel4(void);
void comm_manager(void);
void TIM1_TRG_COM_TIM17_IRQHandler(void);
void TIM4_IRQHandler(void);
void tankLevelStabSetup(void);
void tankLevelStab(void);
void Lcd_write_16b(uint16_t tmp);
void Lcd_write_8b(uint8_t tmp);
void run_uart_cmd(void);


