plantalog/cadi-gcl/stm32f100/current/main.c
void Lcd_write_8b(uint8_t tmp) {
	if (lcd_pointery==0) {
		LCDLine1[lcd_pointerx++] = (tmp/100)+48;
	}
	else {
		LCDLine2[lcd_pointerx++] = (tmp/100)+48	;
	}
	Lcd_write_digit(tmp%100);

}

void calibrateFlowMeter(void){
	uint8_t button=0, valve=0, counter_id=0, volume=0;
	uint16_t ticks_in_10cl=0;
	uint32_t cnt_val1=0, cnt_val2=0;
	Lcd_clear();
	Lcd_write_str("Choose one:");
	vTaskDelay(500);

	while (button==0) {
		button = readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("1:");
		Lcd_write_16b(water_counter[0]);
		Lcd_write_str("2:");
		Lcd_write_16b(water_counter[1]);
		Lcd_goto(1,0);
		vTaskDelay(10);
		Lcd_write_str("3:");
		Lcd_write_16b(water_counter[2]);
		Lcd_write_str("4:");
		Lcd_write_16b(water_counter[3]);
	}
	Lcd_clear();
	counter_id = button-1;
	button=0;
	Lcd_write_str("Choose valve");
	valve = adjust8bit(valve);
	close_valve(valve);
	Lcd_clear();
	Lcd_write_str("How much x10CL?");
	volume = adjust8bit(volume);
	cnt_val1 = water_counter[counter_id];
	Lcd_clear();
	Lcd_write_str("OK to finish");
	open_valve(valve);
	button=0;
	while (button!=BUTTON_OK) {
		vTaskDelay(10);
		button=readButtons();
		Lcd_clear();
		Lcd_write_str("Current value:");
		Lcd_goto(1,0);
		Lcd_write_16b(water_counter[counter_id]);
	}
	cnt_val2 = water_counter[counter_id];
	close_valve(valve);
	vTaskDelay(200);

	ticks_in_10cl=(uint16_t)(cnt_val2-cnt_val1)/(uint16_t)volume;	// how much ticks for 10 CL?
	wfCalArray[counter_id] = ticks_in_10cl;	// ticks in 10cl
	Lcd_clear();
	Lcd_write_str("Ticks:");
	Lcd_write_16b(cnt_val2);
	Lcd_goto(1,0);
	Lcd_write_str("10CL=");
	Lcd_write_16b(ticks_in_10cl);
	EE_WriteVariable(WFM_CAL_OFFSET, ticks_in_10cl);
	button=0;
	while (button!=BUTTON_OK) {
		vTaskDelay(10);
		button=readButtons();
	}
	Lcd_clear();
	vTaskDelay(200);
}

void get_water_cl(uint8_t valve, uint8_t counter_id, uint16_t amount)
{
	uint32_t cnt_to_reach=0;
	cnt_to_reach = ((uint32_t)amount*(uint32_t)wfCalArray[0])/10;
	uint8_t button=0;
	open_valve(0);		// HARDCODE
	water_counter[counter_id] = 0;
	while (water_counter[0]<cnt_to_reach) {
		vTaskDelay(10);
	}
	close_valve(0);		// HARDCODE
}

void get_water_tick(uint8_t valve, uint8_t counter_id, uint32_t ticks)
{
	uint8_t button=0;
	open_valve(0);		// HARDCODE
	water_counter[counter_id] = 0;
	while (water_counter[0]<ticks) {
		vTaskDelay(10);
	}
	close_valve(0);		// HARDCODE
}

void get_water(uint8_t valve, uint8_t counter_id, uint16_t amount){	// amount in CL (10ml) max 65535x10=650L
	uint32_t cnt_to_reach=0, cnt1=0, cnt2=0;
	uint16_t volume=0;
	uint8_t button=0;
	Lcd_clear();
	Lcd_write_str("Calibrate WFM?");
	while (button==0) {
		vTaskDelay(10);
		button=readButtons();
	}
	if (button==BUTTON_OK) {
		calibrateFlowMeter();
	}


//	vTaskDelay(10000);
	uint8_t repeat=1;
	while (repeat==1) {
		Lcd_clear();
		Lcd_write_str("CL amount:");
		Lcd_write_16b(wfCalArray[0]);
		volume = adjust16bit_fast(volume, 5);
	//	cnt1=water_counter[0];
	//	cnt_to_reach = water_counter[0]+(volume*wfCalArray[0])/10;
		cnt_to_reach = ((uint32_t)volume*(uint32_t)wfCalArray[0])/10;

		Lcd_clear();
		Lcd_write_str("Adding");
		Lcd_write_16b((uint16_t)cnt_to_reach);
		Lcd_goto(1,0);
		Lcd_write_str("to ");
		Lcd_write_16b((uint16_t)water_counter[water_counter[counter_id]]);
		button=0;
		open_valve(0);		// HARDCODE
		water_counter[counter_id] = 0;
		while (water_counter[0]<cnt_to_reach) {
			vTaskDelay(10);
			Lcd_clear();
			Lcd_write_str("Cur:");
			Lcd_write_16b((uint16_t)water_counter[counter_id]);
			Lcd_goto(1,0);
			Lcd_write_str("of:");
			Lcd_write_16b(cnt_to_reach);
		}
		close_valve(0);		// HARDCODE
		Lcd_clear();
		Lcd_write_str("Repeat?");
		while (button==0) {
				vTaskDelay(10);
				button=readButtons();
		}
		if (button==BUTTON_OK) {
			repeat=1;
			water_counter[0]=0;
		}
		else {
			repeat=0;
		}
	}
}

void Lcd_write_16b(uint16_t tmp) {
	Lcd_write_digit((uint16_t)tmp/10000);
	Lcd_write_digit((uint16_t)(tmp%10000)/100);
	Lcd_write_digit((uint16_t)tmp%100);
}

void comm_manager(void){
	int transferred=0;
	uint16_t buff;
	if (comm_state==COMM_SET_SETTINGS) {
		TxByte = 48;
		while (transferred<SETTINGS_PACKET_SIZE*2) {
			if (RxDataReady==1) {
				if (transferred%2==0) {
					buff=RxByte;
				}
				else {
					buff<<=8;
					buff+=RxByte;
					EE_WriteVariable(SETTINGS_START_ADDR+(transferred/2), buff);
				}
				TxByte = RxByte;
				RxDataReady=0;
				TxDataReady=1;
				vTaskDelay(1);
				transferred++;
			}
			//USART1_IRQHandler();
		}
		comm_state = COMM_MONITOR_MODE;
	}

	if (comm_state==COMM_DIRECT_DRIVE) {
		switch (RxByte) {
		case 49:
			plugStateSet(0, 0);	// enable plug for ph up pump
			break;
		case 50:
			plugStateSet(0, 1);	// enable plug for ph up pump
			break;
		case 51:
			plugStateSet(1, 0);	// enable plug for ph up pump
			break;
		case 52:
			plugStateSet(1, 1);	// enable plug for ph up pump
			break;
		case 53:
			plugStateSet(2, 0);	// enable plug for ph up pump
			break;
		case 54:
			plugStateSet(2, 1);	// enable plug for ph up pump
			break;
		case 97:	// a
			open_valve(0);	// open valve
			break;
		case 98:	// b
			close_valve(0);	// close valve
			break;
		case 99:	// c
			open_valve(1);	// open valve
			break;
		case 100:	// d
			close_valve(1);	// close valve
			break;
		case 101:	// e
			open_valve(2);	// open valve
			break;
		case 102:	// f
			close_valve(2);	// close valve
			break;
		case 103:	// g
			break;
		case 104:	// h
			break;
		}
	}

	if (comm_state==COMM_GET_SETTINGS) {


		for (transferred=5; transferred!=0; transferred--) {
			TxByte = transferred;
			TxDataReady=1;
			vTaskDelay(1);
			USART1_IRQHandler();
		}
		transferred=0;
		while (transferred<SETTINGS_PACKET_SIZE*2) {	// *2 bacuse each 16 bit var should be sent in two TX cycles
			if (TxDataReady==0) {
				if (transferred%2==0) {	// if sending odd (or even?) byte
					EE_ReadVariable(SETTINGS_START_ADDR+(transferred/2), &buff);
				}
				vTaskDelay(1);
				TxByte = (buff&0xFF00)>>8;
				buff<<=8;
				TxDataReady=1;
				USART1_IRQHandler();
				transferred++;
			}
			vTaskDelay(1);
		}
		comm_state = COMM_MONITOR_MODE;
	}
	vTaskDelay(1);
	comm_state=comm_state;
}

#define STATE_NOTHING					0
#define STATE_CONFIGURATION_PAYLOAD		1
#define STATE_CONFIGURATION_CRC			2
#define STATE_COMMAND_TYPE				3
#define STATE_COMMAND_PAYLOAD			4
#define STATE_COMMAND_CRC				5


