plantalog/cadi-gcl/stm32f100/current/main.c
#define RXM_NONE						0
#define RXM_CMD							4
#define RXM_SET							3
uint8_t cmdbuf[10];		// command packet buffer
uint8_t cmdbufp=0;		// pointer
uint8_t prefixDetectionIdx=0;
uint8_t pb_pntr=0;			// packet buffer pointer
uint8_t packet_length=0;
uint8_t rxm_state=0;
uint8_t packet_ready=0;		// packet readiness flag. reset after command execution

void USART1_IRQHandler(void)
{

	if (RxCounter>6) {
			RxCounter=0;
	}
	if (USART_GetITStatus(BT_USART, USART_IT_RXNE) != RESET) {
			RxByte=(USART_ReceiveData(BT_USART) & 0x7F);
			RxBuffer[RxCounter++] = RxByte;
			USART1->SR &= ~USART_FLAG_RXNE;
	}
	BT_USART->SR &= ~USART_SR_TC;

	if (packet_ready==0) {
		if (rxm_state==RXM_CMD) {
			if (pb_pntr==0) {	// getting packet length
				packet_length=RxByte;	// packet length
			}
			cmdbuf[pb_pntr++]=RxByte;

			if (packet_length==pb_pntr) {
				packet_ready=1;
				rxm_state=RXM_NONE;
				pb_pntr=0;
			}

		}


		if (RxByte==90) {
			// ready
			prefixDetectionIdx = 1;
		}
		else if (RxByte==88 && prefixDetectionIdx==1) {
			// steady
			prefixDetectionIdx = 2;
		}
		else if (prefixDetectionIdx==2) {
			if (RxByte==48) {
				// escaping zero
			}
			else if (RxByte==49){
				// settings
				rxm_state=RXM_SET;
			}
			else if (RxByte==50) {
				// command
				rxm_state=RXM_CMD;
				pb_pntr=0;	// packet buffer pointer to zero to start reading new payload
			}
			prefixDetectionIdx = 0;
		}
	}
}

static void uart_task(void *pvParameters){
	while (1) {
		if (packet_ready==1) {
			run_uart_cmd();
			packet_ready=0;
		}
		vTaskDelay(10);
	}
}

void rx_flush(){
	uint8_t i=0;
	for (i=0; i<7; i++){
		cmdbuf[i] = 0;
	}
}

void run_uart_cmd(void){
	switch (cmdbuf[1]) {
		case 0:
			get_water(cmdbuf[2],cmdbuf[3],cmdbuf[4]*256+cmdbuf[5]);
			break;
		case 1:
			plugStateSet(cmdbuf[2], cmdbuf[3]);
			break;
		case 2:
			comm_state=COMM_DIRECT_DRIVE;
			break;
		case 3:
			comm_state=COMM_MONITOR_MODE;
			break;
		case 4:
			open_valve(cmdbuf[2]);
			break;
		case 5:
			close_valve(cmdbuf[2]);
			break;
	}
	rx_flush();

}

/* void onPacketType(uint8_t b) {
        // depending on packet type we transit to next state
        switch (b) {
        case 1: // for configuration packet type...
            // uint8_t payload[400];
            payloadIdx = 0;
            rxm_state = STATE_CONFIGURATION_PAYLOAD;
            break;
        case 2: // for command packet type...
        	rxm_state = STATE_COMMAND_TYPE; // ...expect command type to be read next
            break;
        }
        crc = 0;
}

void onPayloadByte(uint8_t b, uint8_t nextState) {
         // on each payload byte - fill payload buffer and calculate crc
         payload[payloadIdx++] = b;
         if (payloadIdx == countof(payload)) {
             rxm_state = nextState;
         }
         crc(b);
} */


void DMA1_Channel4_IRQHandler (void)
{
  if(DMA1->ISR & DMA_ISR_TCIF4) { }  
//  if(DMA1->ISR & DMA_ISR_HTIF4) { }      //


//  if(DMA1->ISR & DMA_ISR_TEIF4) { }      
}

void DMA1_Channel5_IRQHandler (void)
{

 if(DMA1->ISR & DMA_ISR_TCIF5) { }
// if(DMA1->ISR & DMA_ISR_HTIF5) { }
// if(DMA1->ISR & DMA_ISR_TEIF5) { }
}

#ifdef KOSTYLI_MODE
void bluetooth_init(void){
	NVIC_InitTypeDef NVIC_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;


    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);

    // Tx on PA9 as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Rx on PA10 as input floating */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);


  USART_InitTypeDef USART_InitStructure;

  // USART 1 init
  USART_DeInit(USART1);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

  USART_InitStructure.USART_BaudRate = 9600;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(USART1, &USART_InitStructure);

  USART_ClearFlag(USART1, USART_FLAG_CTS | USART_FLAG_LBD  |
                        USART_FLAG_TC  | USART_FLAG_RXNE
                );

  USART_Cmd(USART1, ENABLE);

}

#endif

#ifndef KOSTYLI_MODE
void bluetooth_init(void){
	NVIC_InitTypeDef NVIC_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);

    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
//    NVIC_Init(&NVIC_InitStructure);

    // Tx on PA9 as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Rx on PA10 as input floating */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

/*
    // DMA USART1 setup
    DMA_InitTypeDef DMA_InitStructure;

    // USARTy_Tx_DMA_Channel (triggered by USARTy Tx event) Config
    DMA_DeInit(USARTy_Tx_DMA_Channel);
    DMA_InitStructure.DMA_PeripheralBaseAddr = USARTy_DR_Base;
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)TxBuffer1;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize = TxBufferSize1;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(USARTy_Tx_DMA_Channel, &DMA_InitStructure);
*/



  USART_InitTypeDef USART_InitStructure;

