plantalog/cadi-gcl/stm32f100/current/main.c
  // USART 1 init
  USART_DeInit(USART1);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

  USART_InitStructure.USART_BaudRate = 9600;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(USART1, &USART_InitStructure);

  USART_ClearFlag(USART1, USART_FLAG_CTS | USART_FLAG_LBD  |
                        USART_FLAG_TC  | USART_FLAG_RXNE
                );
  USART1->CR1  |= USART_CR1_RXNEIE;
  USART1->CR1  |= USART_CR1_TCIE;
  USART_Cmd(USART1, ENABLE);
  NVIC_EnableIRQ(USART1_IRQn);     
/*
  
  if ((RCC->AHBENR & RCC_AHBENR_DMA1EN) != RCC_AHBENR_DMA1EN)
  RCC->AHBENR |= RCC_AHBENR_DMA1EN;
  // set source and target addresses and data amount to be transferred
  DMA1_Channel4->CPAR  =  (uint32_t)&USART1->DR;   // USART data adress
  DMA1_Channel4->CMAR  =  (uint32_t)&log_str[0];   // memory address
  DMA1_Channel4->CNDTR =  64;                      // data amount

  DMA1_Channel4->CCR   =  0;                       //reset config register
  DMA1_Channel4->CCR   = ~DMA_CCR4_CIRC;           //disable cyclic mode
  DMA1_Channel4->CCR  |=  DMA_CCR4_DIR;            //direction: read FROM memory
  
  DMA1_Channel4->CCR   = ~DMA_CCR4_PSIZE;          //data size 8 bit
  DMA1_Channel4->CCR   = ~DMA_CCR4_PINC;           //do not use increment of pointer
  
  DMA1_Channel4->CCR   = ~DMA_CCR4_MSIZE;          //data size 8 bit
  DMA1_Channel4->CCR  |=  DMA_CCR4_MINC;           //use pointer increment
  USART1->CR3 |= USART_CR3_DMAT;                    //enable transfer USART1 through DMA */
//  USART1->CR3 |= USART_CR3_DMAR;                    //enable receiving USART1 via DMA

/*  // Enable USARTy DMA TX Channel
  DMA_Cmd(USARTy_Tx_DMA_Channel, ENABLE);

  // Enable USARTz DMA TX Channel
  DMA_Cmd(USARTz_Tx_DMA_Channel, ENABLE); */

}

#endif

unsigned char GetStateDMAChannel4(void)
{
  if(DMA1->ISR & DMA_ISR_TCIF4) return 1;   //transmission finished
  return 0;                                 //transmission in prograss
}
//********************************************************************************
//Function: start exchange in  direction "memory-DMA-USART1"                           //
//Argument: amount of data                                        //
//********************************************************************************
void StartDMAChannel4(unsigned int LengthBufer)
{
  DMA1_Channel4->CCR   = ~DMA_CCR4_EN;      //disable DMA channel
  DMA1_Channel4->CNDTR =  LengthBufer;      //load data amount to transmit
  DMA1->IFCR          |=  DMA_IFCR_CTCIF4;  //reset end of transmit flag
  DMA1_Channel4->CCR  |=  DMA_CCR4_EN;      //enable DMA channel
}


void valve_motor_control_init(void){		// init PA8-PA11 for valve motor control output
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
		 GPIOA->CRH      &= ~GPIO_CRH_CNF14;
	     GPIOA->CRH   |= GPIO_CRH_MODE14_0;
		 GPIOA->CRH      &= ~GPIO_CRH_CNF13;
	     GPIOA->CRH   |= GPIO_CRH_MODE13_0;
		 GPIOA->CRH      &= ~GPIO_CRH_CNF12;
	     GPIOA->CRH   |= GPIO_CRH_MODE12_0;
		 GPIOA->CRH      &= ~GPIO_CRH_CNF11;
	     GPIOA->CRH   |= GPIO_CRH_MODE11_0;
}

void valve_feedback_init(void){		// init PA5-7 as input for 3V valve feedback

	// v1.4 config assumes PA5-7 pins as feedback, implement init function


// PA5-7 setup
	GPIO_InitTypeDef GPIO_InitStructure;
	EXTI_InitTypeDef EXTI_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	  // Enable GPIOA clock
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

	  // Configure PA5-7 pin as input pull-down
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	  GPIO_Init(VALVE_SENSOR_PORT, &GPIO_InitStructure);
/*
	  // Enable AFIO clock
//	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
	  // Connect EXTI10 Line to PC10 pin
	  GPIO_EXTILineConfig(VALVE_SENSOR_PORT_SOURCE, GPIO_PinSource5);

	  // Configure EXTI5 line
	  EXTI_InitStructure.EXTI_Line = EXTI_Line5;
	  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	  EXTI_Init(&EXTI_InitStructure);

	  // Configure EXTI6 line

	  GPIO_EXTILineConfig(VALVE_SENSOR_PORT_SOURCE, GPIO_PinSource6);
	  EXTI_InitStructure.EXTI_Line = EXTI_Line6;
	  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	  EXTI_Init(&EXTI_InitStructure);

	  // Configure EXTI12 line

	  GPIO_EXTILineConfig(VALVE_SENSOR_PORT_SOURCE, GPIO_PinSource7);
	  EXTI_InitStructure.EXTI_Line = EXTI_Line7;
	  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	  EXTI_Init(&EXTI_InitStructure);

	  // Enable and set EXTI15_10 Interrupt to the lowest priority
	  NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

	  NVIC_Init(&NVIC_InitStructure); */
}



void water_level_input_init(void){
#ifdef WFM_PINS_PB0_1
		GPIO_InitTypeDef GPIO_InitStructure;
		EXTI_InitTypeDef EXTI_InitStructure;
		NVIC_InitTypeDef NVIC_InitStructure;

		  // Enable GPIO clock
		  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

		  // Configure PB0-2 pins as input pull-down
		  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
		  GPIO_Init(GPIOB, &GPIO_InitStructure);


// interrupt config for water level sensor inputs

