plantalog/cadi-gcl/stm32f100/current/main.c
		  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource0);
		  EXTI_InitStructure.EXTI_Line = EXTI_Line0;
		  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
		  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
		  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		  EXTI_Init(&EXTI_InitStructure);

		  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource1);
		  EXTI_InitStructure.EXTI_Line = EXTI_Line1;
		  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
		  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
		  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		  EXTI_Init(&EXTI_InitStructure);

		  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
		  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		  NVIC_Init(&NVIC_InitStructure);

		  NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
		  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		  NVIC_Init(&NVIC_InitStructure);

#endif
}

void dosing_motor_control_init(void){	// init PC6-PC9 as PWM output for dosing pump control
	  GPIO_InitTypeDef GPIO_InitStructure;
	  TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	  TIM_OCInitTypeDef TIM_OCInitStruct;

//	  volatile int i;
//	  int n = 1;
//	    int brightness = 0;

	    RCC_APB2PeriphClockCmd(
	            RCC_APB2Periph_GPIOC |
	            RCC_APB2Periph_AFIO, ENABLE );

	    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM3, ENABLE );

	    GPIO_StructInit(&GPIO_InitStructure); // Reset init structure

	    // Setup Blue & Green LED on STM32-Discovery Board to use PWM.
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;            // Alt Function - Push Pull
	    GPIO_Init( GPIOC, &GPIO_InitStructure );
	    GPIO_PinRemapConfig( GPIO_FullRemap_TIM3, ENABLE );        // Map TIM3_CH3 to GPIOC.Pin8, TIM3_CH4 to GPIOC.Pin9

	    // Let PWM frequency equal 100Hz.
	    // Let period equal 1000. Therefore, timer runs from zero to 1000. Gives 0.1Hz resolution.
	    // Solving for prescaler gives 240.
	    TIM_TimeBaseStructInit( &TIM_TimeBaseInitStruct );
	    TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV4;
	    TIM_TimeBaseInitStruct.TIM_Period = 1000 - 1;   // 0..999
	    TIM_TimeBaseInitStruct.TIM_Prescaler = 240 - 1; // Div 240
	    TIM_TimeBaseInit( TIM3, &TIM_TimeBaseInitStruct );

	    TIM_OCStructInit( &TIM_OCInitStruct );
	    TIM_OCInitStruct.TIM_OutputState = TIM_OutputState_Enable;
	    TIM_OCInitStruct.TIM_OCMode = TIM_OCMode_PWM1;
	    // Initial duty cycle equals 0%. Value can range from zero to 1000.
	    TIM_OCInitStruct.TIM_Pulse = 0; // 0 .. 1000 (0=Always Off, 1000=Always On)


	    TIM_OC1Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC2Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC3Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC4Init( TIM3, &TIM_OCInitStruct ); // Channel 4 Green LED

	    TIM_Cmd( TIM3, ENABLE );
}

/*
uint8_t get_wsl(uint8_t wsId){
	uint8_t i=0, tmp=0;
	for (i=0; i<8; i++){
		tmp = tmp + (wsl_buff[wsId]>>i)&1;
	}
	if (wsl_buff[wsId]>8) {
		return 1;
	}
	else {
		return 0;
	}
}
*/

void waterSensorStateTrigger(void){
	uint8_t i=0;
	for (i=0; i<2; i++) {
		wsl_buff[i]=wsl_buff[i]<<1;
		wsl_buff[i] = wsl_buff[i] + (((GPIOB->IDR)>>i)&1);

		if (wsl_buff[i]>8) {
			waterSensorStateFlags |= (1<<i);	// set flag
		}
		else {
			waterSensorStateFlags &= ~(1<<i);	//reset flag
		}
	}
}



void tankLevelStabSetup(void){
	Lcd_clear();
	uint16_t curlevel=0;
	uint8_t button=0;
	Lcd_clear();
	Lcd_write_str("Set tank top lvl");
	while (button!=BUTTON_OK) {
		button = readButtons();
		curlevel = sonar_read[0];
		vTaskDelay(5);
		Lcd_goto(1,0);
		Lcd_write_digit(curlevel/100);
		Lcd_write_digit(curlevel);
	}
	vTaskDelay(10);
	EE_WriteVariable(WATER_TANK_TOP, curlevel);
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(2000);
	Lcd_write_str("Set btm lvl");
	while (button!=BUTTON_OK) {
		button = readButtons();
		curlevel = sonar_read[0];
		vTaskDelay(5);
		Lcd_goto(1,0);
		Lcd_write_digit(curlevel/100);
		Lcd_write_digit(curlevel);
	}
	button=0;
	vTaskDelay(10);
	EE_WriteVariable(WATER_TANK_BOTTOM, curlevel);
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(2000);
	Lcd_clear();
	loadSettings();
}

void tankLevelStab(void){
#ifdef TANK_STAB_ENABLE
	if (sonar_read[0]>(tank_windows_top[0]+2)) {
		open_valve(1);
	}
	if (sonar_read[0]<tank_windows_top[0]) {
		close_valve(1);
	}
#endif
}


void open_valve(uint8_t valveId){
	vTaskDelay(1);
#ifdef USE_VALVES
	uint8_t curstatus=0, cur_valve_failed=0, duration=0;;
	curstatus=VALVE_SENSOR_PORT->IDR&(1<<(VALVE_SENSOR_GPIO_SHIFT+valveId));	// check if valve flag active now
	curstatus>>=valveId+VALVE_SENSOR_GPIO_SHIFT;	// ostavit' toka flag
	cur_valve_failed=valve_failed&(1<<valveId);	// check if valve failure flag is off
	cur_valve_failed>>=valveId;	// ostavit' toka flag
	if (curstatus==0 && cur_valve_failed==0) {	// if no failure detected and current status is ok
		run_valve_motor(valveId);
		uint16_t timeout=VALVE_FAILURE_TIMEOUT;	// valve failure timeout
		while (duration<3 && timeout>0) {
			if ((((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT+valveId) & 1)==1) {
				duration++;
			}
			else {
				duration=0;
			}
			vTaskDelay(1);
			timeout--;
		}
		if (timeout==0) {
			valve_failed |= (1<<valveId);
		}
		stop_valve_motor(valveId);
	}
	valveFlags |= (1<<valveId);
	vTaskDelay(5);
#endif
}

void close_valve(uint8_t valveId){
	run_valve_motor(valveId);
	uint8_t duration=0, curstatus=0, cur_valve_failed=0;
	uint16_t timeout=VALVE_FAILURE_TIMEOUT;	// uint8_t fixed to uint16_t
	curstatus=VALVE_SENSOR_PORT->IDR&(1<<(VALVE_SENSOR_GPIO_SHIFT+valveId));	// check if valve flag active now
	curstatus>>=valveId+VALVE_SENSOR_GPIO_SHIFT;	// ostavit' toka flag
	cur_valve_failed=valve_failed&(1<<valveId);	// check if valve failure flag is off
	cur_valve_failed>>=valveId;	// ostavit' toka flag
	if (curstatus==1 && cur_valve_failed==0) {	// if no failure detected and current status is ok
		while (duration<3 && timeout>0) {
					// this if statement filters occasional "0"s on GPIO (more needed for "1"s on open_valve())
					if ((((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT+valveId) & 1)==0) {
						duration++;
					}
					else {
						duration=0;
					}
					vTaskDelay(1);
					timeout--;
		}
	}


	stop_valve_motor(valveId);
	valveFlags &= ~(1<<valveId); // sbrosit' flag
}




