plantalog/cadi-gcl/stm32f100/current/main.c
// updates valve_state variable
/*
void valve_status_updater(void){
#ifdef USE_VALVES
	uint8_t i=0;

		for (i=0; i<(VALVE_AMOUNT); i++) {
			vTaskDelay(5);
			if (((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT+i) & 1) {
				valve_state |= (1<<i);	// set flag
			}
			else {
				valve_state &= ~(1<<i);	//reset flag
			}
		}
		vTaskDelay(10);


#endif
}
*/

void run_valve_motor(uint8_t valveId){

//	void setPwmDc(uint8_t duty_cycle){		// duty_cycle in %
//	TIM3->CCR3 = duty_cycle*10;
//	TIM3->CCR4 = 1000 - duty_cycle*10;
	VALVE_MOTOR_PORT->BRR |= (1<<valveId+VALVE_MOTOR_GPIO_SHIFT);
//	}
//	setPwmDc(0);
//	VALVE_MOTOR_PORT->BSRR |= (1<<valveId);
//	GPIOC->BSRR= GPIO_BSRR_BS9;
}

void stop_valve_motor(uint8_t valveId){
//	setPwmDc(100);
	VALVE_MOTOR_PORT->BSRR |= (1<<valveId+VALVE_MOTOR_GPIO_SHIFT);
}



void EXTI0_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line0);
#ifdef WFM_PINS_PB0_1	// water flow meter (WFM) driver actions
	water_counter[0]++;
#endif
}

void EXTI1_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line1);
#ifdef WFM_PINS_PB0_1
	water_counter[1]++;
#endif

}

void EXTI2_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line2);
//	water_counter++;

}

void EXTI15_10_IRQHandler(void)
{
    // Clear the  EXTI line 10-12 pending bit
	EXTI_ClearITPendingBit(EXTI_Line10);
	EXTI_ClearITPendingBit(EXTI_Line11);
	EXTI_ClearITPendingBit(EXTI_Line12);
//    valve_status_updater();
}

void EXTI9_5_IRQHandler(void)
{
    // Clear the  EXTI line 10-12 pending bit
	EXTI_ClearITPendingBit(EXTI_Line5);
	EXTI_ClearITPendingBit(EXTI_Line6);
	EXTI_ClearITPendingBit(EXTI_Line7);
//    valve_status_updater();
}

void valve_test2(void){
	uint8_t button=0, curvalve=0, i=0;
	Lcd_clear();
#ifdef USE_VALVES

	//Lcd_write_str("Open/close valve");
#endif
	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		Lcd_goto(0,0);
		Lcd_write_str("curvalve:");
		Lcd_write_digit(curvalve);
/*		tmp=water_counter[0];
		Lcd_write_16b(tmp);

		tmp=sonar_read[0];
//		Lcd_write_digit(tmp/100);
		Lcd_write_digit(tmp);
		Lcd_write_str("cm"); */



		if (button==BUTTON_FWD){
			open_valve(curvalve);
		}
		if (button==BUTTON_CNL){
			close_valve(curvalve);
		}
		if (button==BUTTON_BCK){
			if (curvalve<2) {
				curvalve++;
			}
			else {
				curvalve=0;
			}
		}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_str("VF");
		Lcd_write_digit(valveFlags);
//		uint16_t val=0;
/*		val = VALVE_SENSOR_PORT->IDR>>5;
		Lcd_write_digit(val/10000);
		Lcd_write_digit(val/100);
		Lcd_write_digit(val);
		Lcd_write_str(" "); */

		vTaskDelay(1);

		Lcd_write_str("States:");
		for (i=0; i<3; i++) {
			if (VALVE_SENSOR_PORT->IDR>>(curvalve+i) & 1) {
						Lcd_write_str("1");
					}
					else {
						Lcd_write_str("0");
					}
		}

#endif
	}
	Lcd_clear();
}


void valve_test(void){
	uint8_t button=0, curState=0, i=0, curvalve=0;
	uint16_t tmp=0;
	Lcd_clear();
#ifdef USE_VALVES

	//Lcd_write_str("Open/close valve");
#endif
	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		Lcd_goto(0,0);
		tmp=water_counter[0];
		Lcd_write_16b(tmp);

		tmp=sonar_read[0];
//		Lcd_write_digit(tmp/100);
		Lcd_write_digit(tmp);
		Lcd_write_str("cm");

		tmp=TIM17->CNT;
		Lcd_write_16b(tmp);

//		for (i=0; i<3; i++) {
//			curState = valveFlags&(1<<i);
//			curState>>=i;	// ostavit' toka flag

			if (button==BUTTON_FWD){
					//if (curState==1){
						//close_valve(0);
					//}
					//else {
					//	run_valve_motor(0);
					//	run_valve_motor(1);
						open_valve(1);
					//	run_valve_motor(2);
					//}
			}
			if (button==BUTTON_BCK){
				//if (curState==1){
					//stop_valve_motor(0);
					stop_valve_motor(1);
					close_valve(1);
					//stop_valve_motor(2);
				//}
				//else {
				//	open_valve(1);
				//}
			}
//		}
		vTaskDelay(1);
		Lcd_goto(1,0);
		Lcd_write_digit(valveFlags);
		Lcd_write_str("VS");
		uint16_t val=0;
		val = VALVE_SENSOR_PORT->IDR>>5;
		Lcd_write_16b(val);
		Lcd_write_str(" ");

		vTaskDelay(1);
		if (VALVE_SENSOR_PORT->IDR>>5 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR>>6 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}

		if (VALVE_SENSOR_PORT->IDR>>7 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
#endif

		Lcd_write_str("W");

//		Lcd_write_digit(wsl_buff[0]/100);
//		Lcd_write_digit(wsl_buff[0]);
//		Lcd_write_digit(waterSensorStateFlags);
//		Lcd_write_digit(GPIOB->IDR/100);
//		Lcd_write_digit(GPIOB->IDR);

	}
	Lcd_clear();
	valve_test2();
}

void water_program_setup(progId){
	uint16_t addr=0, tempvalue=0;
	uint32_t tmp32, interval;

	// choose tank top water level sensor
	addr = WP_OFFSET+progId*WP_SIZE+TOP_WATER_SENSOR_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Set top sensor");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);


	// choose tank bottom water level sensor
	addr = WP_OFFSET+progId*WP_SIZE+BOTTOM_WATER_SENSOR_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Set bottom sensor");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set fresh water fill timeout, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WATER_FILL_TIMEOUT_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtr fill timeout");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set circulation pump plug id
//	addr = WP_OFFSET+progId*WP_SIZE+WP_CIRCULATION_PUMP_PLUG_SHIFT;
	EE_ReadVariable(CIRCULATION_PUMP_ID_ADDR, &tempvalue);
	Lcd_clear();
	Lcd_write_str("CircPump plug ID");
	tempvalue = adjust8bit(tempvalue);
	EE_WriteVariable(CIRCULATION_PUMP_ID_ADDR, tempvalue);
	circulationPumpId = tempvalue;
	addr = EE_PLUG_SETTINGS+tempvalue;
	EE_WriteVariable(addr, 70);		// HARDCODE!!! program (timer) id for circulation pump
	plugSettings[tempvalue] = 70;

	// set watering pump plug id
	addr = WP_OFFSET+progId*WP_SIZE+WP_WATERING_PUMP_PLUG_ID;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtrng pump plug");
	tempvalue = adjust8bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);
	addr = EE_PLUG_SETTINGS+tempvalue;
	EE_WriteVariable(addr, 71);		// HARDCODE!!! program (timer) id for watering pump
	plugSettings[tempvalue] = 71;

	// set watering duration, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WP_DURATION_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtrng duration");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set watering duration, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL_SHIFT;
	interval = EE_ReadWord(addr);
	Lcd_clear();
	Lcd_write_str("Set run interval");
	vTaskDelay(500);
	interval = CTimerAdjust(interval);
	EE_WriteWord(addr, interval);

	addr = WP_OFFSET+progId*WP_SIZE+WP_DRAIN_DURATION_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Drain duration");
	vTaskDelay(500);
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

