plantalog/cadi-gcl/stm32f100/current/main.c
	// enable watering program (=1 enables the WP)
	addr = WP_OFFSET+progId*WP_SIZE+WP_ENABLE_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Enable WP?");
	tempvalue = adjust8bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);



//	EE_ReadWord(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Start program?");
	uint8_t button=0;
	while (button==0) {
		button=readButtons();
		vTaskDelay(10);
	}
	if (button==BUTTON_OK) {
		// set initial time point of watering program
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		tmp32 = RTC_GetCounter();
		EE_WriteWord(addr, tmp32);

		addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
		EE_WriteWord(addr, (RTC_GetCounter()-interval+5));
//			run_watering_program(progId);
	}
	if (button==BUTTON_CNL) {
		Lcd_clear();
		Lcd_write_str("Start time");
		vTaskDelay(1000);
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		tmp32 = EE_ReadWord(addr);
		tmp32 = timeAdjust(tmp32, 1);
		EE_WriteWord(addr, tmp32);
	}
	Lcd_clear();
	Lcd_write_str("End time");
	vTaskDelay(1000);
	addr = WP_OFFSET+progId*WP_SIZE+WP_END_TIME_SHIFT;
	tmp32 = EE_ReadWord(addr);
	tmp32 = timeAdjust(tmp32, 1);
	EE_WriteWord(addr, tmp32);
	Lcd_clear();
	vTaskDelay(200);

	vTaskSuspendAll();
	loadSettings();
	xTaskResumeAll();
}

void fertilization_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	fertilizer_mixing_program_setup(progId);
}

void watering_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	water_program_setup(progId);
}

// set fertilizer mixing programs
void fertilizer_mixing_program_setup(progId){
	uint16_t addr=0, tempvalue=0;

	// choose dosing pump to use
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Fertilizer 2 use");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set dosing time, seconds
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Dosing duration");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set circulation pump mixing time
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_CIRCULATION_MIXING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Aftermix time");		// setting the time for running circulation pump to mix the fertilizer into solution
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set watering program to associate this fertilizer mix program with
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_2_WP_ASSOC_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Link to WP");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set frequency (N), showing how often this fertilizer mixing program activates (every N watering program run)
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Trig. freq. N");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set ENABLED/DISABLED status for this program
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_ENABLE;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("ENABLE FMP?");
	tempvalue = adjust16bit(tempvalue);
	vTaskDelay(10);
	EE_WriteVariable(addr, tempvalue);
	Lcd_clear();
	vTaskDelay(10);
	loadSettings();
}

void startWp(void){
	uint8_t progId=0, button=0;
	uint32_t addr, tmp32, interval;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	Lcd_clear();
	Lcd_write_str("Start WP#");
	Lcd_write_digit(progId);
	Lcd_write_str("?");
	while (button!=BUTTON_OK && button!=BUTTON_CNL) {
//		dht_get_data();
		vTaskDelay(30);
		button=readButtons();
	}
	vTaskDelay(200);
	if (button==BUTTON_OK) {
		addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL_SHIFT;
		interval = EE_ReadWord(addr);
		// set initial time point of watering program
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		tmp32 = RTC_GetCounter();
		EE_WriteWord(addr, tmp32);

		addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
		EE_WriteWord(addr, (RTC_GetCounter()-interval+5));
//			run_watering_program(progId);
	}
	Lcd_clear();
	vTaskDelay(200);
}

void run_watering_program(progId){
	wpStateFlags|=(1<<progId);	// set active flag for this program
	close_valve(DRAIN_VALVE_ID);	// close drain valve
//	valveFlags=0;	// all valves to off;
	uint16_t addr, sensorId, fmpLink, wateringPlugId=0;
	uint8_t i, waterSensorFlag=0;
	uint32_t now=0, end=0, wateringDuration=0, lastTime=0;
	vTaskDelay(1);

	addr = WP_OFFSET+progId*WP_SIZE+TOP_WATER_SENSOR_SHIFT;
	EE_ReadVariable(addr, &sensorId);

	// water fill timeout
	addr = WP_OFFSET+progId*WP_SIZE+WATER_FILL_TIMEOUT_SHIFT;
	EE_ReadVariable(addr, &wateringDuration);
	now = RTC_GetCounter();
	end = now + wateringDuration;

	vTaskDelay(5);
	// fill the tank
	open_valve(0);
//	valveFlags=1;		// open fill valve | HARDCODE
	while (waterSensorFlag==0 && now<end) {
		now = RTC_GetCounter();
		waterSensorFlag=waterSensorStateFlags&(1<<sensorId);	// check if water level reached top sensor
		waterSensorFlag>>=sensorId;	// ostavit' toka flag
		vTaskDelay(25);
	}
	close_valve(0);
//	valveFlags=0;
	//close_valve(0, 0);		// HARDCODE
	vTaskDelay(1000);


	// mix fertilizers
	for (i=0; i<FMP_PROGRAMS_AMOUNT; i++) {

		// count current N value
		uint16_t n=0;
		uint32_t curN=0, interval=0, startime=0;
		addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL_SHIFT;
		interval = EE_ReadWord(addr);
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		startime = EE_ReadWord(addr);
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_TRIG_FREQUENCY_SHIFT;
		EE_ReadVariable(addr, &n);
		curN = (RTC_GetCounter()-startime)/interval;
		uint8_t rest = curN/n;

