plantalog/cadi-gcl/stm32f100/current/main.c
		uint16_t enabled=0;
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_2_WP_ASSOC_SHIFT;
		EE_ReadVariable(addr, &fmpLink);
		addr = FMP_OFFSET+i*FMP_SIZE+FMP_ENABLE;
		EE_ReadVariable(addr, &enabled);
		if (fmpLink==progId && enabled==1 && rest==0) {
			run_fertilizer_mixer(i);
		}
		vTaskDelay(10);
	}

	// run watering
	addr = WP_OFFSET+progId*WP_SIZE+WP_DURATION_SHIFT;
	EE_ReadVariable(addr, &wateringDuration);
	addr = WP_OFFSET+progId*WP_SIZE+WP_WATERING_PUMP_PLUG_ID;
	EE_ReadVariable(addr, &wateringPlugId);
	vTaskDelay(10);
//	now=0;
	now = RTC_GetCounter();
	end = RTC_GetCounter() + wateringDuration;
	vTaskDelay(10);
	addr = WP_OFFSET+progId*WP_SIZE+BOTTOM_WATER_SENSOR_SHIFT;
	EE_ReadVariable(addr, &sensorId);
	i=0;
	waterSensorFlag = 1;
//	uint8_t cTimerStateFlag = 0;
	while (now<end) {
		vTaskDelay(10);
		waterSensorFlag=waterSensorStateFlags&(1<<sensorId);	// check if water level reached top sensor
		waterSensorFlag>>=sensorId;	// ostavit' toka flag
		i=cTimerStateFlags&1;	// HARDCODE!!! (0)
//		i>>=0;	// ostavit' toka flag
		if ((lastTime<RTC_GetCounter()) && i==1 && waterSensorFlag==1) {
			now++;
			lastTime=RTC_GetCounter();
		}
		vTaskDelay(5);
//		if (waterSensorFlag==0) {
//			now=end;
//		}
		// now=RTC_GetCounter();
		plugStateSet(wateringPlugId, (1&i&waterSensorFlag));
	}
	plugStateSet(wateringPlugId, 0);
	// drain the rest of the tank
//	addr = WP_OFFSET+progId*WP_SIZE+WP_DRAIN_DURATION_SHIFT;
//	EE_ReadVariable(addr, &wateringDuration);
//	now = RTC_GetCounter();
//	end = now + wateringDuration*10;
//	valveFlags = 2;	//	open drain valve, while the rest are shut
	vTaskDelay(10);
	open_valve(DRAIN_VALVE_ID);
/*	while (now<end) {
		vTaskDelay(10);
	}
	open_valve(0);
	end = wateringDuration+RTC_GetCounter();
	while (waterSensorFlag!=1 || now<end) {
		waterSensorFlag=waterSensorStateFlags&(1<<sensorId);	// check if water level reached top sensor
		waterSensorFlag>>=sensorId;	// ostavit' toka flag
		now = RTC_GetCounter();
		vTaskDelay(25);
	}
	close_valve(0,0); */

	addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
	EE_WriteWord(addr, RTC_GetCounter());	// write last run time

	wpStateFlags &= ~(1<<progId); // sbrosit' flag
	vTaskDelay(200);
}

void run_fertilizer_mixer(progId){
	uint16_t dosingTime, dosingPumpId, circulationMixingTime, addr;
	uint32_t dosingEndTime=0;

	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
	EE_ReadVariable(addr, &dosingTime);

	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
	EE_ReadVariable(addr, &dosingPumpId);

	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_CIRCULATION_MIXING_TIME_SHIFT;
	EE_ReadVariable(addr, &circulationMixingTime);

	dosingEndTime = RTC_GetCounter()+dosingTime;
	enable_dosing_pump(dosingPumpId, 1);
	while (RTC_GetCounter()<dosingEndTime) {
		vTaskDelay(10);
	}
	enable_dosing_pump(dosingPumpId, 0);
	run_circulation_pump(circulationMixingTime);
}

void run_circulation_pump(uint16_t time){
	uint32_t endTime=0;
	endTime = RTC_GetCounter()+time;
	plugStateSet(circulationPumpId, 1);
	while (RTC_GetCounter()<endTime) {
		vTaskDelay(10);
	}
	plugStateSet(circulationPumpId, 0);
}

void enable_dosing_pump(uint8_t pumpId, uint8_t state){
//	uint32_t* addr;
//	addr = &TIM3->CCR1+pumpId*2;		// TIM3->CCR1 Address offset: 0x34. from page 327 of RM0041
//	*addr = 100*state;


	if (state==1) {
		dosingPumpStateFlags |= (1<<pumpId);
	}
	else {
		dosingPumpStateFlags &= ~(1<<pumpId);
	}

	state = 1-state;	// 0% pwm means running motor

	if (pumpId==0) {
		TIM3->CCR1 = state*1000;
	}
	if (pumpId==1) {
		TIM3->CCR2 = state*1000;
	}
	if (pumpId==2) {
		TIM3->CCR3 = state*1000;
	}
	if (pumpId==3) {
		TIM3->CCR4 = state*1000;
	}
}

void watering_program_trigger(void *pvParameters){
	uint32_t curtime, lastRun, interval, diff, startTime, endTime;
	uint16_t addr;
	uint8_t wpStateFlag=0, progId, enabled;
	// reinit valves
	open_valve(DRAIN_VALVE_ID);
	close_valve(0);

	while (1) {
//
		for (progId=0; progId<3; progId++){		// HARDCODE!
			vTaskDelay(10);
			addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
			lastRun = EE_ReadWord(addr);
			curtime = RTC_GetCounter();
			addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL_SHIFT;
			interval = EE_ReadWord(addr);
			diff = curtime-lastRun;
			addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
			startTime = EE_ReadWord(addr);	// program start time point
			addr = WP_OFFSET+progId*WP_SIZE+WP_END_TIME_SHIFT;
			endTime = EE_ReadWord(addr);	// program end time point
			addr = WP_OFFSET+progId*WP_SIZE+WP_ENABLE_SHIFT;
			EE_ReadVariable(addr, &enabled);	// program start time point

			vTaskDelay(10);
			wpStateFlag=wpStateFlags&(1<<progId);	// check if WP active now
			wpStateFlag>>=progId;	// ostavit' toka flag
			if (diff>interval && curtime>startTime && curtime<endTime && enabled==1){
				run_watering_program(progId);
			}
			vTaskDelay(10);
		}
	}

}




void dht_init(void){
	// RCC Config
	  /* TIM15 clock enable */
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM15, ENABLE);

	  // GPIO Config
	  GPIO_InitTypeDef GPIO_InitStructure;

	  /* TIM15 channel 2 pin (PB15) configuration */
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	// NVIC Config

	  GPIO_PinRemapConfig(GPIO_Remap_TIM15, ENABLE);
	  NVIC_InitTypeDef NVIC_InitStructure;

	   /* Enable the TIM15 global Interrupt */

	  NVIC_InitStructure.NVIC_IRQChannel = TIM1_BRK_TIM15_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	  NVIC_Init(&NVIC_InitStructure);

	   TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
	   TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	   TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	   TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	   TIM_ICInitStructure.TIM_ICFilter = 0x0;

