plantalog/cadi-gcl/stm32f100/current/main.c
	   TIM_PWMIConfig(TIM15, &TIM_ICInitStructure);

	   /* Select the TIM15 Input Trigger: TI2FP2 */
	   TIM_SelectInputTrigger(TIM15, TIM_TS_TI2FP2);

	   /* Select the slave Mode: Reset Mode */
	   TIM_SelectSlaveMode(TIM15, TIM_SlaveMode_Reset);

	   /* Enable the Master/Slave Mode */
	   TIM_SelectMasterSlaveMode(TIM15, TIM_MasterSlaveMode_Enable);

	   /* TIM enable counter */
	   TIM_Cmd(TIM15, ENABLE);

	   /* Enable the CC2 Interrupt Request */
	   TIM_ITConfig(TIM15, TIM_IT_CC2, ENABLE);

}

void dht_init_out(void){	// init GPIO pin as OUTput
	 GPIOB->CRH      &= ~GPIO_CRH_CNF15;		// ... and PB15 for DHT triggering
     GPIOB->CRH   |= GPIO_CRH_MODE15_0;
}

/******************************************************************************/
/*            STM32F10x Peripherals Interrupt Handlers                        */
/******************************************************************************/

/**
  * @brief  This function handles TIM3 global interrupt request.
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  /* Clear TIM3 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM3, TIM_IT_CC2);

  /* Get the Input Capture value */
  IC2Value = TIM_GetCapture2(TIM3);

  if (IC2Value != 0)
  {
    /* Duty cycle computation */
    DutyCycle = (TIM_GetCapture1(TIM3) * 100) / IC2Value;

    /* Frequency computation */
    Frequency = SystemCoreClock / IC2Value;
  }
  else
  {
    DutyCycle = 0;
    Frequency = 0;
  }
  // fill one more value of dht bits array
  dht_bit_array[dht_bit_position]=DutyCycle;
  dht_bit_position++;

}

void TIM1_BRK_TIM15_IRQHandler(void)		// DHT moved from PA7 to PB15. 11.07.2013
{
  /* Clear TIM3 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM15, TIM_IT_CC2);

  /* Get the Input Capture value */
  IC2Value = TIM15->CCR2;

  if (IC2Value != 0)
  {
    /* Duty cycle computation */
    DutyCycle = ((TIM15->CCR1) * 100) / IC2Value;

    /* Frequency computation */
 //   Frequency = SystemCoreClock / IC2Value;
  }
  else
  {
    DutyCycle = 0;
    Frequency = 0;
  }
  // fill one more value of dht bits array
//  dht_bit_array[dht_bit_position]=TIM_GetCapture1(TIM15);
  dht_bit_array[dht_bit_position]=DutyCycle;
  dht_bit_position++;
//  dht_bit_array[dht_bit_position]=TIM15->CCR2;
//  dht_bit_position++;
}


void TIM1_UP_TIM16_IRQHandler(void)		// DHT moved from PA7 to PB15. 11.07.2013
{
  /* Clear TIM16 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM16, TIM_IT_CC1);

  /* Get the Input Capture value */
//  sonar_read[0] = TIM16->CNT;
}

void TIM1_TRG_COM_TIM17_IRQHandler(void)		// DHT moved from PA7 to PB15. 11.07.2013
{
  /* Clear TIM16 Capture compare interrupt pending bit */
  TIM_ClearITPendingBit(TIM17, TIM_IT_CC1);
//  TIM17->SR &= ~TIM_SR_CC1IF;
  /* Get the Input Capture value */
  if (!(GPIOB->IDR & (1<<9))) {
	  sonar_read[0]=SONAR1_TIM->CNT;
  }
  SONAR1_TIM->CNT = 0;
}


void dht_get_data(void){	// function starts getting data from DHT22 sensor
//	SONAR1_TIM->EGR |= TIM_EGR_CC1G;
	vTaskDelay(25);
	  uint8_t i;
	  for (i=0;i<50;i++) {
		dht_bit_array[i]=0;
	  }
	  dht_bit_ready = 0;
	  dht_bit_position = 0;
	  dht_init_out();
	  DHT_0;
//	  GPIOA->BRR = (1<<DHT_TRIG_PLUG);		// set 0
	  vTaskDelay(5);
	  DHT_1;
	  dht_init();
	  vTaskDelay(200);

	  dht_bit_ready = 1;
	  dht_bit_position = 0;
//	  GPIOA->BSRR = (1<<DHT_TRIG_PLUG);	// set 1
	  vTaskDelay(5);
	  dht_conv_data();
}

void dht_conv_data(void){ // convert DHT impulse lengths array into numbers and strings of T and rH
	uint8_t i, i2;
	uint16_t caps1[45];
//	uint16_t zero_ticks, one_ticks;
	vTaskDelay(10);
	if (dht_bit_ready==1) {
		int dht_buf_pointer=DHT_DATA_START_POINTER;	// points the dht data start bit
		for (i=0;i<45;i++) {
			caps1[i]=dht_bit_array[i];
		}
		dht_data_ready = 0;
		for (i=0; i<5; i++){
			dht_data[i]=0;
			vTaskDelay(10);
			for (i2=8; i2>0; i2--) {
/*				if (caps1[dht_buf_pointer]>25 && caps1[dht_buf_pointer]<35) {
					dht_data[i] |= (1<<(i2-1)); // set i2 bit in dht_data[i]
				}
				*/
				if (caps1[dht_buf_pointer]>25 && caps1[dht_buf_pointer]<35) {
				}
				else {
					dht_data[i] |= (1<<(i2-1)); // set i2 bit in dht_data[i];
				}
				dht_buf_pointer++;
			}
		}
		vTaskDelay(10);

		DHTValue.DHT_Humidity = dht_data[0]*256+dht_data[1];
		DHTValue.DHT_Temperature = dht_data[2]*256+dht_data[3];
		DHTValue.DHT_CRC = dht_data[5];

		if (DHTValue.DHT_Humidity>rhWindowBottom && DHTValue.DHT_Humidity<rhWindowTop) {
			rhUnderOver=0;
		}
		if (DHTValue.DHT_Humidity<rhWindowBottom) {
			rhUnderOver=1;
		}
		if (DHTValue.DHT_Humidity>rhWindowTop) {
			rhUnderOver=2;
		}

		vTaskDelay(10);
		dht_t_str[0] = (DHTValue.DHT_Temperature%1000)/100+48;
		dht_t_str[1] = (DHTValue.DHT_Temperature%100)/10+48;
		dht_t_str[2] = 46;
		dht_t_str[3] = (DHTValue.DHT_Temperature%10)+48;

		vTaskDelay(10);
		dht_rh_str[0] = (DHTValue.DHT_Humidity%1000)/100+48;
		dht_rh_str[1] = (DHTValue.DHT_Humidity%100)/10+48;
		dht_rh_str[2] = 46;
		dht_rh_str[3] = (DHTValue.DHT_Humidity%10)+48;

		dht_data_ready = 1;
	}
}

void dht_arr_displayer(void){
//	dht_get_data();
	uint8_t button=0;
	uint8_t arr_pointer=0;
	while (button!=BUTTON_OK) {
//		dht_get_data();
		vTaskDelay(30);
#ifdef TEST_MODE
		button=readButtons();
		Lcd_goto(0,0);
		Lcd_write_digit(arr_pointer);
		Lcd_write_str(": ");
		Lcd_write_digit(dht_bit_array[arr_pointer]/100);
		Lcd_write_digit(dht_bit_array[arr_pointer]);
		if (button==BUTTON_FWD) {
			if (arr_pointer==255) {
				arr_pointer==0;
			}
			else {
				arr_pointer++;
			}
		}
		if (button==BUTTON_BCK){
			if (arr_pointer==0) {
				arr_pointer==255;
			}
			else {
				arr_pointer--;
			}
		}
#endif


		Lcd_goto(1,0);
		Lcd_write_str("T:");
		copy_arr(&dht_t_str, &LCDLine2, 4, 2);
		Lcd_goto(1,7);
		Lcd_write_str("rH:");
		copy_arr(&dht_rh_str, &LCDLine2, 4, 10);
	}
	Lcd_clear();
}


uint8_t adc2ph(uint16_t adcval){
	return ((adcval - ph0)*10)/cdel;
}

uint16_t ph2adc(uint8_t ph){
	return (ph*cdel)/10+ph0;
}

void phStabSettings(void){	// function guides user through setting the pH level stabilizer window
	uint16_t phadcvalue=0;
	uint8_t phval=0;
	Lcd_clear();
	Lcd_write_str("Set top pH lvl");
	vTaskDelay(10);
	EE_ReadVariable(PH_WINDOW_TOP, &phadcvalue);
	phval = adc2ph(phadcvalue);
	phval = readPhVal(phval);
	vTaskDelay(10);
	EE_WriteVariable(PH_WINDOW_TOP, ph2adc(phval));
	Lcd_clear();
	Lcd_write_str("Set btm lvl");
	vTaskDelay(10);
	EE_ReadVariable(PH_WINDOW_BOTTOM, &phadcvalue);
	phval = adc2ph(phadcvalue);
	phval = readPhVal(phval);
	vTaskDelay(10);
	EE_WriteVariable(PH_WINDOW_BOTTOM, ph2adc(phval));
	Lcd_clear();
}

uint8_t readPercentVal(uint8_t value){
	uint8_t button=0;
	char prcntStr[5];
	value %= 101;	// drop all except 0..100
	while (button!=BUTTON_OK) {
		button = readButtons();
		Lcd_goto(1,3);
		prcntStr[0] = (value%1000)/100;
		prcntStr[1] = (value%100)/10;
		prcntStr[2] = (value%10);
		Lcd_write_str("<");
		copy_arr(prcntStr, LCDLine2, 3, 6);
		Lcd_goto(1,12);
		Lcd_write_str(">");
		vTaskDelay(10);
		if (button==BUTTON_FWD) {
			if (value<100) {
				value++;
			}
			else {
				value=0;
			}
		}
		if (button==BUTTON_BCK) {
			if (value<1) {
				value=0;
			}
			else {
				value--;
			}
		}
		vTaskDelay(10);
	}
	return value;
}

void hygroStatSettings(void){
	uint16_t rh_value=0;
	uint8_t rh_val=0;
	Lcd_clear();
	Lcd_write_str("Set top rH lvl");
	vTaskDelay(10);
	EE_ReadVariable(RH_WINDOW_TOP, &rh_value);
//	rh_val = adc2ph(phadcvalue);
	rh_val = readPercentVal(rh_value);
	vTaskDelay(10);
	EE_WriteVariable(RH_WINDOW_TOP, rh_val);
	Lcd_clear();
	Lcd_write_str("Set bottom lvl");
	vTaskDelay(10);
	EE_ReadVariable(RH_WINDOW_BOTTOM, &rh_value);
//	phval = adc2ph(phadcvalue);
	rh_val = readPercentVal(rh_value);
	vTaskDelay(10);
	EE_WriteVariable(RH_WINDOW_BOTTOM, rh_val);
	Lcd_clear();
}

void convPh2str(uint8_t ph, char* phstr){
	phstr[3] = ph-(ph/10)*10+48;
	vTaskDelay(5);
	ph/=10;
	phstr[2]=46;
	phstr[1] = ph-(ph/10)*10+48;
	vTaskDelay(5);
	ph/=10;
	phstr[0]=ph-(ph/10)*10+48;
	phstr[4] = 0;	// konec stroki
}

uint8_t readPhVal(uint8_t value){
	uint8_t button=0;

	char phStr[5];
	while (button!=BUTTON_OK) {
		button = readButtons();
		Lcd_goto(1,3);
		convPh2str(value, &phStr);
		Lcd_write_str("<");
		copy_arr(phStr, LCDLine2, 4, 6);
		Lcd_goto(1,12);
		Lcd_write_str(">");
		vTaskDelay(10);
		if (button==BUTTON_FWD) {
			if (value<254) {
				value++;
			}
			else {
				value=0;
			}
		}
		if (button==BUTTON_BCK) {
			if (value<1) {
				value=0;
			}
			else {
				value--;
			}
		}
		vTaskDelay(10);
	}
	return value;
}

void Lcd_write_16int(uint16_t d){
	int i;
	char out[5];
	out[5] = '\0';
	out[4] = '0' + ( d       )    % 10;
	out[3] = '0' + ( d /= 10 )    % 10;
	out[2] = '0' + ( d /= 10 )    % 10;
	out[1] = '0' + ( d /= 10 )    % 10;
	out[0] = '0' + ( d /= 10 )    % 10;
	copy_arr(&out, LCDLine2, 6, 0);
	for (i=0;i<5;i++) {
		Lcd_write_str(out[i]);
	}
}

