plantalog/cadi-gcl/stm32f100/current/main.c
void Delay_us(uint32_t delay){
	uint32_t del=delay*250; while (del--){}
}

uint16_t get_average_adc(uint8_t amount){
	uint8_t i=0;
	uint32_t sum = 0;
	for (i=0; i<amount; i++) {
		sum += JDR_BUTTONS;
	}
	return sum/amount;
}

void buttonCalibration(void){	// buttons calibration function
	uint16_t button_val[4], diff;
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_arr("<", 1);
	Delay_us(30000);
	Delay_us(100);
	button_val[0] = get_average_adc(10);
	Lcd_goto(0,0);
	Lcd_write_arr("OK", 2);
	Delay_us(30000);
	Delay_us(100);
	button_val[1] = get_average_adc(10);
	Lcd_goto(0,0);
	Lcd_write_arr("CANCEL", 6);
	Delay_us(30000);
	Delay_us(100);
	button_val[2] = get_average_adc(10);
	Lcd_clear();
	Lcd_write_arr(">", 1);
	Delay_us(30000);
	Delay_us(100);
	button_val[3] = get_average_adc(10);

	if ((button_val[3]>>3)<(button_val[0]>>3)) {
		buttonReverse = 1;
	}
	else if ((button_val[3]>>3)>(button_val[0]>>3)) {
		buttonReverse = 0;
	}
	else {
		// loadButtonSettings();	// no key pressed, loading settings from EEPROM
		buttonReverse = 2;	//means loading button settings from EEPROM
	}
	if (buttonReverse == 0) {
		diff = ((button_val[1]-button_val[0])/2)-5;
		button_ranges[0] = (button_val[0]-diff/2);	// 05.09.13. NxtLn commented
//		button_ranges[0] = button_val[0]-diff;
		button_ranges[1] = button_val[0]+diff;
		button_ranges[2] = button_val[1]-diff;
		diff = ((button_val[2]-button_val[1])/2)-5;
		button_ranges[3] = button_val[1]+diff;
		button_ranges[4] = button_val[2]-diff;
		diff = ((button_val[3]-button_val[2])/2)-5;
		button_ranges[5] = button_val[2]+diff;
		button_ranges[6] = button_val[3]-diff;
		button_ranges[7] = (button_val[3]+diff/2); 	// 05.09.13. NxtLn commented
//		button_ranges[7] = button_val[3]+diff;
		saveButtonRanges();
	}
	else if (buttonReverse == 1) {
		diff = ((button_val[0]-button_val[1])/2)-5;
		button_ranges[0] = button_val[0]-diff;
		button_ranges[1] = button_val[0]+diff;
		button_ranges[2] = button_val[1]-diff;
		diff = ((button_val[1]-button_val[2])/2)-5;
		button_ranges[3] = button_val[1]+diff;
		button_ranges[4] = button_val[2]-diff;
		diff = ((button_val[2]-button_val[3])/2)-5;
		button_ranges[5] = button_val[2]+diff;
		button_ranges[6] = button_val[3]-diff;
		button_ranges[7] = button_val[3]+diff;
		saveButtonRanges();
	}
	else {
		Lcd_write_str("EEPROM buttons");
		readButtonRanges();
	}

	if (button_ranges[0]>button_ranges[8]) {
				buttonReverse=1;
	}
	Lcd_goto(0,0);
	Lcd_write_str("Complete");
}

void displayAdcValues(void){
#ifdef TEST_MODE
	uint8_t button=0;
	Lcd_clear();
	vTaskDelay(500);
	while (button!=BUTTON_OK){
		button=readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("1:");
		Lcd_write_digit(ADC1->JDR1/100);
		Lcd_write_digit(ADC1->JDR1);
		Lcd_write_str(" 2:");
		Lcd_write_digit(ADC1->JDR2/100);
		Lcd_write_digit(ADC1->JDR2);
		Lcd_goto(1,0);
		Lcd_write_str("3:");
		Lcd_write_digit(ADC1->JDR3/100);
		Lcd_write_digit(ADC1->JDR3);
		Lcd_write_str(" 4:");
		Lcd_write_digit(ADC1->JDR4/100);
		Lcd_write_digit(ADC1->JDR4);
		vTaskDelay(20);
	}
	Lcd_clear();
#endif
}

void display_usart_rx2(void){	// another usart test fr displaying cmdbuf contents
		uint8_t button=0, i=0;
		Lcd_clear();
		vTaskDelay(500);
		while (button!=BUTTON_OK){
			button=readButtons();
			Lcd_goto(0,0);
			vTaskDelay(2);
			for (i=0; i<5;i++) {
				Lcd_write_8b(cmdbuf[i]);
			}
			vTaskDelay(1);
			Lcd_goto(1,0);
			Lcd_write_8b(cmdbuf[5]);
			Lcd_write_8b(cmdbuf[6]);

			Lcd_write_str(" ");
			Lcd_write_digit(rxm_state);
			Lcd_write_digit(RxCounter);
			Lcd_write_digit(prefixDetectionIdx);
			Lcd_write_digit(packet_length);
//			copy_arr(&RxBuffer, &LCDLine2, 7,9);
//			Lcd_write_arr(&RxBuffer, 7);
			vTaskDelay(20);
		}
		Lcd_clear();
}

void display_usart_rx(void){
		uint8_t button=0, i=0;
		Lcd_clear();
		vTaskDelay(500);
		while (button!=BUTTON_OK){
			button=readButtons();
			Lcd_goto(0,0);
			vTaskDelay(2);
			for (i=0; i<5;i++) {
				Lcd_write_8b(RxBuffer[i]);
			}
			vTaskDelay(1);
			Lcd_goto(1,0);
			Lcd_write_8b(RxBuffer[5]);
			Lcd_write_8b(RxBuffer[6]);
			Lcd_write_str(" ");
			Lcd_write_digit(RxCounter);
			copy_arr(&RxBuffer, &LCDLine2, 7,9);
//			Lcd_write_arr(&RxBuffer, 7);
			vTaskDelay(20);
		}
		Lcd_clear();
}


void saveButtonRanges(void){
	uint8_t i;
	for (i=0; i<8; i++) {
		EE_WriteVariable(BUTTON_RANGES_START_ADDR+i, button_ranges[i]);
	}
}

void readButtonRanges(void){
	uint8_t i;
	for (i=0; i<8; i++) {
		EE_ReadVariable(BUTTON_RANGES_START_ADDR+i, &button_ranges[i]);
	}
}

static void sdLog(void *pvParameters){	// store current device data into log
	char tmpstr[15];
	int i;
	uint32_t tmp;
	vTaskDelay(150);
	while(1){
	tmp = RTC_GetCounter();
		vTaskDelay(2);
		if (tmp>lastWriteTime) {
			lastWriteTime=RTC_GetCounter();
			int32str(tmp, &tmpstr);
			vTaskDelay(2);
			for (i=0; i<10; i++){
				log_str[i]=tmpstr[i];	// current time
			}
			vTaskDelay(2);
			log_str[10]=44;	// ascii comma

			vTaskDelay(2);
			vTaskSuspendAll();
			for (i=0;i<4;i++){
				log_str[i+11]=curphstr[i];	// current pH value
				log_str[i+16]=curecstr[i];	// current EC value
			}
			xTaskResumeAll();
			vTaskDelay(2);
			log_str[15]=44;
			log_str[20]=44;
			uint16_t flg=0;
	    	for (i=0; i<3; i++) {
	    		flg=plugStateFlags&(1<<i);	// plug state flags
	    		flg>>=i;
	    		log_str[i+21]=flg+48;
	    	}

	    	log_str[24]=44;	// ascii comma
	    	copy_arr(&dht_t_str, &log_str, 4, 25);	// temperature
	    	log_str[29]=44;	// ascii comma
	    	copy_arr(&dht_rh_str, &log_str, 4, 30);	// humidity
//			str[20]=13;		// CR
	    	log_str[34]=44;	// ascii comma
	    	for (i=0; i<3; i++) {
	    		flg=waterSensorStateFlags&(1<<i);	// water sensor state
	    		flg>>=i;
	    		log_str[i+35]=flg+48;
	    	}
	    	log_str[38]=44;	// ascii comma
	      	for (i=0; i<3; i++) {
	      		flg = VALVE_SENSOR_PORT->IDR & (1<<i+VALVE_SENSOR_GPIO_SHIFT); // valve sensor actual state
	      		flg>>=i+VALVE_SENSOR_GPIO_SHIFT;
	      		log_str[i+39]=flg+48;
	    	}

	      	log_str[42]=44;	// ascii comma

#ifdef USE_VALVES
	    	for (i=0; i<3; i++) {
	    		flg=valveFlags&(1<<i);	// valves sensors flags
	    		flg>>=i;
	    		log_str[i+43]=flg+48;
	    	}

	    	log_str[46]=44;	// ascii comma
#endif
#ifndef USE_VALVES
	    	for (i=0; i<3; i++) {
	    		log_str[i+43]=48;
	    	}

	    	log_str[46]=44;	// ascii comma
#endif

	    	for (i=0; i<3; i++) {
	    		flg = VALVE_MOTOR_PORT->ODR & (1<<i+VALVE_MOTOR_GPIO_SHIFT); // valve motor actual state
	    		flg>>=i+VALVE_MOTOR_GPIO_SHIFT;
	    		log_str[i+47]=flg+48;
	    	}


