plantalog/cadi-gcl/stm32f100/current/main.c
	    	log_str[50]=44;	// ascii comma
#ifdef USE_VALVES
	    	for (i=0; i<3; i++) {
	    		flg = valveFlags & (1<<i); // valve motor state flags
	    		flg>>=i;
	    		log_str[i+51]=flg+48;
	    	}
#endif
#ifndef USE_VALVES
	    	for (i=0; i<3; i++) {
	    		log_str[i+51]=48;
	    	}
#endif

	    	log_str[54]=44;	// ascii comma

	    	for (i=0; i<3; i++) {
	    		flg = dosingPumpStateFlags & (1<<i); // dosing pump flags
	    		flg>>=i;
	    		log_str[i+55]=flg+48;
	    	}

	    	log_str[58]=44;	// ascii comma
	    	for (i=0; i<3; i++) {
	    		flg = wpStateFlags & (1<<i); // watering program state flags
	    		flg>>=i;
	    		log_str[i+59]=flg+48;
	    	}






//	    	str[41]=44;	// ascii comma
	    	log_str[62]=13;		// CRC

	    	//for (i=0;i<62;i++) {
	    	//	log_str[62] ^= log_str[i];
	    	//}

	    	log_str[63]=10;		// U
	    	logstr_crc=0;

			string2log(&log_str, 64);
			vTaskDelay(2);
		}//
		vTaskDelay(2);
		dht_get_data();
		tankLevelStab();
		sonar_ping();
	}
}



FRESULT string2log(char* str, int bytes){
	FRESULT res;
	if (no_sd==0) {
		  static FIL logfile;
		  UINT len;
		  char FileName[]="0:CADIZLOG";
	//	  logfile = malloc(sizeof (FIL));
	//      taskENTER_CRITICAL();
		  vTaskSuspendAll();

		  res = f_open(&logfile, FileName, FA_WRITE | FA_READ);
	//	  vTaskDelay(50);
		  if(res) {
			  res = f_open(&logfile, FileName, FA_WRITE | FA_CREATE_ALWAYS);
	//		  vTaskDelay(50);
			  if(res) return res;
		  };
		  res = f_lseek(&logfile, f_size(&logfile));
		  if(res) return res;

		  res = f_write(&logfile, str, bytes, &len);
		  if(res) return res;
		  res = f_sync(&logfile);
		  if(res) return res;

		  res = f_close(&logfile);
	//      taskEXIT_CRITICAL();
		  xTaskResumeAll();
	}
	else {
		res=0;	// force 0 output for no functioning SD card
	}
      return res;
}

void push2str(char* str1, char* str2, char *out){
	int len1,len2,i;
	len1=sizeof(str1);
	len2=sizeof(str2);
	for (i=0;i<len1;i++) {
		out[i]=str1[i];
	}
	for (i=len1;i<(len1+len2);i++) {
		out[i]=str2[(i-len1)];
	}

}

void calibratePh(){
	int button = 0;
	uint16_t ph;
//	char phstr[4];
	char buffer[5];
//	char *pbuffer;
	while (button!=BUTTON_OK){
		button = readButtons();
//		Lcd_clear();
		vTaskDelay(5);
		Lcd_goto(0,0);
		Lcd_write_str("Use pH7");
//		Lcd_goto(0,8);
		vTaskDelay(5);
//		ph_seven32 = ph_seven;
#ifdef TEST_MODE
		EE_ReadVariable(PH7_ADDR, &ph_seven);
		int10str(ph_seven, &buffer);
		copy_arr(&buffer, &LCDLine1, 4, 8);
#endif
//		Lcd_write_str(buffer);
		Lcd_goto(1,5);
		int10str(JDR_PH, &buffer);
		Lcd_write_str(buffer);
		vTaskDelay(10);
		Lcd_goto(1,0);
    	getPh();
    	vTaskDelay(10);
    	Lcd_write_str(curphstr);
    	vTaskDelay(100);
    	if (button==button!=BUTTON_CNL) {	// are you sure???

    	}
	}
	ph=JDR_PH;
	EE_WriteVariable(PH7_ADDR, ph);
	button = 0;

	Lcd_goto(0,0);
    	Lcd_write_str("pH7 value saved");
	vTaskDelay(2000);
	while (button!=BUTTON_OK){
		button = readButtons();
		Lcd_clear();
		vTaskDelay(25);
		Lcd_goto(0,0);
		Lcd_write_str("Use pH4");
		Lcd_goto(0,8);
    	getPh();
		adc2str(ph4, &buffer);
		Lcd_write_str(buffer);
		Lcd_goto(1,5);
		adc2str(phAdcValue, &buffer);
		Lcd_write_str(buffer);
		vTaskDelay(25);
		Lcd_goto(1,0);
    	vTaskDelay(25);
    	Lcd_write_str(curphstr);
    	vTaskDelay(500);
	}

	ph=JDR_PH;
	EE_WriteVariable(PH4_ADDR, phAdcValue);
	loadSettings();
}

void calibrateEc(void){
	int button = 0;
	uint16_t ec;
//	char phstr[4];
	char buffer[5];
//	char *pbuffer;
	Lcd_goto(0,0);
	Lcd_write_str("Wipe the probe");
	vTaskDelay(2000);
	while (button!=BUTTON_OK){
		button = readButtons();
//		Lcd_clear();
//		vTaskDelay(5);
		Lcd_goto(0,0);
		vTaskDelay(5);
		Lcd_write_str("OK to set");
//		ph_seven32 = ph_seven;
#ifdef TEST_MODE
		EE_ReadVariable(EC0_ADDR, &ec0);
		int10str(ec0, &buffer);
		copy_arr(&buffer, &LCDLine1, 4, 12);
#endif
//		Lcd_write_str(buffer);
		Lcd_goto(1,6);
		int10str(ecAdcValue, &buffer);
		Lcd_write_str(buffer);
		vTaskDelay(10);
		Lcd_goto(1,0);
    	getEc();
    	vTaskDelay(10);
    	Lcd_write_str("0mS = ");
    	vTaskDelay(100);
	}
	ec=ecAdcValue;
	EE_WriteVariable(EC0_ADDR, ec);
	button = 0;
	Lcd_clear();
    Lcd_write_str("0 mS saved");
	vTaskDelay(2000);

	while (button!=BUTTON_OK){
		button = readButtons();
//		Lcd_clear();
		vTaskDelay(5);
		Lcd_clear();
		Lcd_write_str("Use EC1.413");
//		Lcd_goto(0,8);
		vTaskDelay(5);
//		ph_seven32 = ph_seven;
#ifdef TEST_MODE
		EE_ReadVariable(EC1413_ADDR, &ec1413);
		int10str(ec1413, &buffer);
		copy_arr(&buffer, &LCDLine1, 4, 12);
#endif
//		Lcd_write_str(buffer);
		Lcd_goto(1,10);
		int10str(ecAdcValue, &buffer);
		Lcd_write_str(buffer);
		vTaskDelay(10);
		Lcd_goto(1,0);
    	getEc();
    	vTaskDelay(10);
    	Lcd_write_str("1.413mS = ");
    	vTaskDelay(100);
//    	if (button==button!=BUTTON_CNL) {	// wtf?

//    	}
	}
	ec=ecAdcValue;
	EE_WriteVariable(EC1413_ADDR, ec);
	button = 0;

	Lcd_goto(0,0);
    	Lcd_write_str("1.413 mS saved");
	vTaskDelay(2000);

	loadSettings();
}

void getPh() {	// current PH, please!
	uint32_t total=0, ph;
	vTaskDelay(5);
	uint8_t i;
    for(i=0; i < 10; i++) {
    	total += phBuffer[i];
	}
    phAdcValue = total/10;
	if (phAdcValue>phWindowTop) {
		phUnderOver = 2;
	}
	else if (phAdcValue<phWindowBottom) {
		phUnderOver = 1;
	}
	else {
		phUnderOver = 0;
	}
	vTaskDelay(5);
	ph = ((phAdcValue - ph0)*10)/cdel;
	currentPh = ph;
	curphstr[3] = ph-(ph/10)*10+48;
	vTaskDelay(5);
	ph/=10;
	curphstr[2]=46;
	curphstr[1] = ph-(ph/10)*10+48;
	vTaskDelay(5);
	ph/=10;
	curphstr[0]=ph-(ph/10)*10+48;
	curphstr[4] = 0;	// konec stroki
}

void getEc(void){
	uint32_t total=0, ec, ec_div;
	vTaskDelay(5);
	uint8_t i;
    for(i=0; i < 10; i++) {
    	total += ecBuffer[i];
	}
    ecAdcValue = total/10;
	if (ecAdcValue>ecWindowTop) {
		ecUnderOver = 2;
	}
	else if (ecAdcValue<ecWindowBottom) {
		ecUnderOver = 1;
	}
	else {
		ecUnderOver = 0;
	}
	vTaskDelay(5);
//	ec1413 = 200;		// this is 1.413ms
	ec_div = ((ec1413-ec0)*100)/141;		// 0.01mS = ec1413/141. We store it 100 times more for precision

	if (ecAdcValue>ec0) {
		ec = ((ecAdcValue-ec0)*100)/ec_div;	//
	}
	else {
		ec = 0;
	}
//	ec = 210;
//	ec = ecAdcValue/ec_div;
	currentEc = ec;
	curecstr[4] = '\0';
	curecstr[3] = '0' + ( ec       )    % 10;
	curecstr[2] = '0' + ( ec /= 10 )    % 10;
	curecstr[1] = '.';
	curecstr[0] = '0' + ( ec /= 10 )    % 10;

