plantalog/cadi-gcl/stm32f100/current/main.c
void phMonSettings(void) {
//	uint16_t Address;
	uint32_t phSetting;	// possibly 16 bit?
//	char value[8];
	vTaskDelay(10);
	Lcd_clear();
	EE_ReadVariable(PH_INTERVAL, &phSetting);
	vTaskDelay(100);
	Lcd_goto(0,0);
	Lcd_write_str("Probing interval");
	vTaskDelay(1000);
	phSetting=adjust8bit(phSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(PH_INTERVAL, phSetting);
	vTaskDelay(50);


	// analogichno dlja buffer size
	EE_ReadVariable(PH_BUFF_SIZE, &phSetting);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Buffer size");
	vTaskDelay(500);
	phSetting=adjust8bit(phSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(PH_BUFF_SIZE, phSetting);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Complete!");
	vTaskDelay(500);
	loadSettings();
	Lcd_clear();
}

uint8_t adjust8bit(uint8_t val){
	uint8_t button;
	if (val>99) {val=99;}
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			if (val<1) {
				val=99;
			}
			else {
				val--;
			}
		}
		if (button==BUTTON_FWD) {
			if (val>98) {
				val=0;
			}
			else {
				val++;
			}
		}
		Lcd_goto(1,0);
		Lcd_write_str("numero <");
		Lcd_write_digit(val);
		Lcd_write_str(">");
		vTaskDelay(25);
	}
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(200);
	Lcd_clear();
	return val;
}

uint16_t adjust16bit(uint16_t val){
	uint8_t button;
	if (val>65534) {
		val=0;
	}
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			if (val<1) {
				val=65535;
			}
			else {
				val--;
			}
		}
		if (button==BUTTON_FWD) {
			if (val>65534) {

				val=0;
			}
			else {
				val++;
			}
		}
		Lcd_goto(1,0);
		Lcd_write_str("numero <");
		Lcd_write_16b(val);
		Lcd_write_str(">");
		vTaskDelay(25);
	}
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(200);
	return val;
}

uint16_t adjust16bit_fast(uint16_t val, uint8_t speed){
	uint8_t button=0;
	char buffer[11];
	if (val>65534) {
		val=0;
	}
	vTaskDelay(200);
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(speed);
		if (button==BUTTON_BCK) {
			if (val<1) {
				val=65535;
			}
			else {
				val--;
			}
		}
		if (button==BUTTON_FWD) {
			if (val>65534) {

				val=0;
			}
			else {
				val++;
			}
		}
		Lcd_goto(1,0);
		Lcd_write_str("numero <");
//		utoa_fast_div(val, &buffer);
//		copy_arr(&buffer, &LCDLine2, 5, 2);
		Lcd_write_16b(val);
		Lcd_write_str(">");
		vTaskDelay(speed);
	}
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(200);
	return val;
}

uint32_t CTimerAdjust(uint32_t time){
	uint8_t hours, minutes, seconds, hours2, minutes2, seconds2, button;
	char timestr[6];
	seconds = time % 60;
	time /= 60;
	minutes = time % 60;
	time /= 60;
	hours = time % 99;
	Lcd_clear();
	vTaskDelay(20);
	while (button!=BUTTON_FWD)
	{
		button=readButtons();
		if (button==BUTTON_BCK)
			{
				if (hours>98) {hours=0;}	// chtoby pechatat' pobolee znakov, nado zamenit' Lcd_write_digit()
				else {hours++;}
			}
		if (button==BUTTON_OK)
			{
				if (minutes>58) {minutes=0;}
				else {minutes++;}
			}
		if (button==BUTTON_CNL)
			{
				if (seconds>58) {seconds=0;}
				else {seconds++;}
			}

    	vTaskDelay(5);
		Lcd_goto(0,4);
    	Lcd_write_digit(hours);
    	Lcd_write_str(":");
    	Lcd_write_digit(minutes);
    	Lcd_write_str(":");
    	Lcd_write_digit(seconds);
    	vTaskDelay(5);
    	hours2=hours;		// daby izbezhat' konversii tipov pri umnozhenii na 3600 i podobnom
    	minutes2=minutes;
    	seconds2=seconds;
    	time=hours2*3600;
    	time+=minutes2*60;
    	time+=seconds2;
    	vTaskDelay(5);
    	Lcd_goto(1,3);
    	int32str(time, &timestr);
//    	Lcd_write_arr(&timestr, 6);
    	copy_arr(&timestr, LCDLine2, 10, 2);
    	vTaskDelay(10);
	}
	return(time);
}

void setCTimer(uint8_t timerId){
	uint16_t Address;
	uint32_t CTimerData;
//	char value[8];
	vTaskDelay(10);
	Lcd_clear();
	Address = EE_CTIMER_DURATION+timerId*EE_CTIMER_SIZE;
	CTimerData = EE_ReadWord(Address);
	if (CTimerData>356400) {
		CTimerData=356400;
	}
	Lcd_goto(0,2);
	Lcd_write_str("Set DURATION");
	vTaskDelay(3000);
	CTimerData=CTimerAdjust(CTimerData);	// poluchit' novoe znachenie ot user'a
	Address = EE_CTIMER_DURATION+timerId*EE_CTIMER_SIZE;	// adres postojanno "napominaetsja", potomu chto po-hodu ispolnenija koda on kuda-to "terjaetsja". bylo by neploho razobratsja kuda
	EE_WriteWord(Address, CTimerData);
	vTaskDelay(50);


	// analogichno dlja INTERVALa
	Address = EE_CTIMER_INTERVAL+timerId*EE_CTIMER_SIZE;
	CTimerData = EE_ReadWord(Address);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Set INTERVAL");
	vTaskDelay(500);
	CTimerData=CTimerAdjust(CTimerData);	// poluchit' novoe znachenie ot user'a
	Address = EE_CTIMER_INTERVAL+timerId*EE_CTIMER_SIZE;
	EE_WriteWord(Address, CTimerData);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Complete!");
	vTaskDelay(500);
	Lcd_clear();
}

void setTimer(uint8_t timerId){
//	timerId--;	// chtoby Timer 1 byl nulevym
	uint32_t Data, adjusteDate;
	uint16_t Address;
//	int curval=0;
	Address = EE_TIMER1_ON+timerId*EE_TIMER_SIZE;	// set ON for plain timer
//	char value[6];
//	uint8_t button=0;
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Set ON time");
	vTaskDelay(3000);
	Lcd_clear();
	vTaskDelay(50);
	Data = EE_ReadWord(Address);
	vTaskDelay(50);
	adjusteDate = timeAdjust(Data, 1);
	EE_WriteWord(Address, adjusteDate);
	Lcd_clear();
	vTaskDelay(200);
	Lcd_goto(0,2);
	Lcd_write_str("Set OFF time");
	vTaskDelay(50);
	vTaskSuspendAll();
	Address = EE_TIMER1_ON+timerId*EE_TIMER_SIZE+2;	// set OFF for plain timer
	Data = EE_ReadWord(Address);
	xTaskResumeAll();
	vTaskDelay(3000);
	Lcd_clear();
	adjusteDate = timeAdjust(Data, 1);
	EE_WriteWord(Address, adjusteDate);
	Lcd_clear();
	vTaskDelay(50);
	vTaskSuspendAll();
	Address = EE_TIMER1_ON+timerId*EE_TIMER_SIZE+4;	// set daily flag
	Data = EE_ReadWord(Address);
	xTaskResumeAll();
//	dowSelector();
//	curval = Data & 1;
	vTaskDelay(50);
//	yesNoSelector("Every day?", curval);
	Lcd_clear();
}

