plantalog/cadi-gcl/stm32f100/current/main.c
	    dayFromYear = days+datetime.day;

	    if (dayFromYear<60 && (datetime.year % 4)==0){
	    	dayFromYear--;
	    }
	    if (datetime.month==2 && datetime.day>=29 && (datetime.year % 4)==0) {
	        dayFromYear--;
	    }
	    if (dayFromYear<1){dayFromYear=1;}
	    tmp = ((datetime.year-12) * 365 * 86400);
	    tmp += (datetime.hour * 3600);
	    tmp += (datetime.min * 60);
	    tmp += (datetime.sec + YEAR12SECS);
	    tmp += ((dayFromYear-2)*86400);
	    tmp+=(((datetime.year-8)/4)*86400);
	    return tmp;
}

// function returns the programId selected in menu to run the program
int menuSelector(void)
{
	int curItem=0;	// default item to display entering the menu
	int programId = 0;
//	int buttonPressed=readButtons();
	int textId=fatArray[curItem][1];
	while (programId==0){
		textId=fatArray[curItem][1];
		Lcd_goto(0,0);
		Lcd_write_str(menuItemArray[textId]);
		int curButton=readButtons();
		if (curButton>0){
			vTaskDelay(100);
			Lcd_clear();
		}
		vTaskDelay(10);
		if (curButton==BUTTON_OK){
			if (fatArray[curItem][6]==1)		// run program
				{programId=fatArray[curItem][4];}
			else	{curItem=fatArray[curItem][4];}			// enter folder
			Lcd_clear();
		}
		else if (curButton==BUTTON_CNL){
			curItem=fatArray[curItem][5];
			Lcd_clear();
		}
		else if (curButton==BUTTON_BCK){
			curItem=fatArray[curItem][2];
			Lcd_clear();
		}
		else if (curButton==BUTTON_FWD){
			curItem=fatArray[curItem][3];
			Lcd_clear();
		}
	}
	vTaskDelay(1);
	return(programId);
}






// mycontroller.ru code

uint32_t RTC_GetCounter(void)
{
  return  (uint32_t)((RTC->CNTH << 16) | RTC->CNTL);
}






void RTC_SetCounter(uint32_t value)
{
  RTC->CRL |= RTC_CRL_CNF;
  RTC->CNTH = value>>16;
  RTC->CNTL = value;
  RTC->CRL &= ~RTC_CRL_CNF;
}






unsigned char  RtcInit(void)
{

  RCC->APB1ENR |= RCC_APB1ENR_PWREN | RCC_APB1ENR_BKPEN;

  PWR->CR |= PWR_CR_DBP;

  if ((RCC->BDCR & RCC_BDCR_RTCEN) != RCC_BDCR_RTCEN)
  {
    RCC->BDCR |=  RCC_BDCR_BDRST;
    RCC->BDCR &= ~RCC_BDCR_BDRST;
    RCC->BDCR |=  RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL_LSE;
    RTC->CRL  |=  RTC_CRL_CNF;
    RTC->PRLL  = 0x7FFF;        // divider to 32786 hZ
    RTC->CRL  &=  ~RTC_CRL_CNF;
    RCC->BDCR |= RCC_BDCR_LSEON;
    while ((RCC->BDCR & RCC_BDCR_LSEON) != RCC_BDCR_LSEON){}

    RTC->CRL &= (uint16_t)~RTC_CRL_RSF;
    while((RTC->CRL & RTC_CRL_RSF) != RTC_CRL_RSF){}
//    RTC_SetCounter(YEAR12SECS+(212+20)*86400+10*3600+9*60);
    return 1;
  }
  return 0;
}


 uint32_t TimeToRtc(RTC_Time *time )
{
  uint32_t result;
  result  = (uint32_t)time->hour * 3600;
  result += (uint32_t)time->min * 60;
  result +=           time->sec;
  return result;
}

 void RtcToTime( uint32_t cnt, RTC_Time *time )
 {
   time->sec = cnt % 60;
   cnt /= 60;
   time->min = cnt % 60;
   cnt /= 60;
   time->hour = cnt % 24;
 }

 // EOF mycontroller.ru RTC functions



// function slides the buffer window for pH ADC values (and EC)
void phMonitor(void *pvParameters){
 	while(1){
 		int i=0;
 	    for(i=0; i < 9; i++) {
 	            phBuffer[i] = phBuffer[i+1];
 	           ecBuffer[i] = ecBuffer[i+1];

#ifdef KOSTYLI_MODE
 	          			USART1->SR &= ~USART_SR_TC;
 	          			if (log_inc==64){
 	          			    log_inc=0;
 	          			    USART1->DR=13;
 	          			}
 	          			else {
 	          				USART1->DR=log_str[log_inc++];
 	          			}
 //	          		}
#endif
 	          vTaskDelay(2);

 		}
 		phBuffer[9] = JDR_PH;
 		ecBuffer[9] = JDR_EC;
 		vTaskDelay(1);
		waterSensorStateTrigger();
		vTaskDelay(1);
//		valve_status_updater();
		vTaskDelay(1);
  //  	comm_manager();
//		vTaskDelay(1);
 	}
}

void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos){
	int i=0;
	for (i=0; i<amount;i++) {
		destination[i+pos] = source[i];
	}
}


void displayClock(void *pvParameters)
{
		RTC_DateTime	DateTime;
		uint32_t tmp;
		uint8_t button;
//		char str[6];
		Lcd_clear();
    	while (1)
	    {


//    		if (GetStateDMAChannel4()==1){
//    			StartDMAChannel4(64);
//    		}

	    	vTaskDelay(10);
//	    	setPwmDc(20);
    		tmp = RTC_GetCounter();
    		DateTime=unix2DateTime(tmp);
	    	LCDLine1[0]= (DateTime.day / 10) + 48;
	    	LCDLine1[1]= (DateTime.day % 10) + 48;
	    	LCDLine1[2]= 45;
	    	LCDLine1[3]= (DateTime.month / 10) + 48;
	    	LCDLine1[4]= (DateTime.month % 10) + 48;
	    	LCDLine1[5]= 45;
	    	LCDLine1[6]= (DateTime.year / 10) + 48;
	    	LCDLine1[7]= (DateTime.year % 10) + 48;
	    	LCDLine2[6]= 32;
	    	LCDLine2[7]= 32;


	    	Lcd_goto(1,0);
	    	Lcd_write_digit(DateTime.hour);
	    	Lcd_write_digit(DateTime.min);
	    	Lcd_write_digit(DateTime.sec);
    	//	displayAdcValues();

	    	vTaskDelay(5);

	    	Lcd_goto(1,9);
	    	Lcd_write_str("pH:");
	    	vTaskDelay(5);
	    	getPh();
			copy_arr(&curphstr, LCDLine2, 4, 12);
	    	vTaskDelay(5);
	    	Lcd_goto(0,9);
#ifdef	TEST_MODE
	    	Lcd_write_str("EC:");
	    	vTaskDelay(5);
	    	getEc();
	    	vTaskDelay(9);
			copy_arr(&curecstr, LCDLine1, 4, 12);
#endif
//			setPwmDc(90);
#ifndef	TEST_MODE
	    	uint16_t flg;
	    	// vyvod flagov dozirujushih nasosov
	    	uint8_t i;
	    	for (i=0; i<3; i++) {
	    		flg=timerStateFlags&(1<<i);

//	    		flg=wpStateFlags&(1<<i);
//	    		flg=dosingPumpStateFlags&(1<<i);
	    		flg>>=i;
	    		LCDLine1[i+10]=flg+48;
	    	}
	    	// vyvod flagov rozetok
	    	for (i=0; i<3; i++) {
	    		flg=plugStateFlags&(1<<i);
	    		flg>>=i;
	    		LCDLine1[i+13]=flg+48;
	    	}
	    	LCDLine1[9]=phUnderOver+48;
#endif

	    	vTaskDelay(14);
	    	button=readButtons();
	    	vTaskDelay(3);

	    	if (button==BUTTON_OK)
	    	{
	    		vTaskDelay(100);
	    		Lcd_clear();
	    		vTaskDelay(500);
	    		uint8_t progId=menuSelector();
	    		programRunner(progId);
	    	}
	    	// USART_SendData(BT_USART, 50);
//	    	USART1->DR=55;
	    	vTaskDelay(10);
	    }




    	while (1) {


