plantalog/cadi-gcl/stm32f100/current/main.c
    	}
}

uint8_t readButtons(void){
	uint16_t curval = 0;
	uint8_t i;
		curval = get_average_adc(10);
		for (i=0;i<4;i++) {
				if (curval>button_ranges[i*2]+BUTTON_RANGE_SHRINKER && curval<button_ranges[i*2+1]-BUTTON_RANGE_SHRINKER) {
					return i+1;
				}

	}
	return 0;


}

void adcRegularInit(void){

}



void AdcInit(void)
{
	// WARNING NTBU (needs to be updated)! shifting pins down to 0 from 1st, saves some space on discovery board
	RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE1;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF1;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE2;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF2;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE3;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF3;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE4;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF4;

	  RCC->APB2ENR |=  RCC_APB2ENR_ADC1EN;
	  RCC->CFGR    &= ~RCC_CFGR_ADCPRE;
	  ADC1->CR1     =  0;
	  ADC1->CR2    |=  ADC_CR2_CAL;
	  while (!(ADC1->CR2 & ADC_CR2_CAL)){};
	  ADC1->CR2     =  ADC_CR2_JEXTSEL;
	  ADC1->CR2    |=  ADC_CR2_JEXTTRIG;
	  ADC1->CR2    |=  ADC_CR2_CONT;
	  ADC1->CR1    |=  ADC_CR1_SCAN;
	  ADC1->CR1    |=  ADC_CR1_JAUTO;
	  ADC1->JSQR    =  (uint32_t)(4-1)<<20;
	  ADC1->JSQR   |=  (uint32_t)1<<(5*0);
	  ADC1->JSQR   |=  (uint32_t)2<<(5*1);
	  ADC1->JSQR   |=  (uint32_t)3<<(5*2);
	  ADC1->JSQR   |=  (uint32_t)4<<(5*3);
	  ADC1->SMPR1  |=	0x00FFFFFF;
	  ADC1->CR2    |=  ADC_CR2_ADON;
	  ADC1->CR2    |=  ADC_CR2_JSWSTART;
}

void Lcd_write_digit2(uint8_t numb){
	if (numb<10) {
		Lcd_write_data(48);
		Lcd_write_data(48+numb);
	}
	else {
		Lcd_write_data((numb/10)+48);
		Lcd_write_data((numb-(numb/10)*10)+48);
	}
}

void Lcd_write_digit(uint8_t numb){
	if (lcd_pointery==0) {
		LCDLine1[lcd_pointerx] = ((numb%100)/10)+48;
		lcd_pointerx++;
		LCDLine1[lcd_pointerx] = (numb%10)+48;
		lcd_pointerx++;
	}
	else {
		LCDLine2[lcd_pointerx] = ((numb%100)/10)+48;
		lcd_pointerx++;
		LCDLine2[lcd_pointerx] = (numb%10)+48;
		lcd_pointerx++;
	}
}





void prvSetupHardware()
{
	RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;     // Enable clock on GPIOC.
//	        GPIOC->CRH      &= ~GPIO_CRH_CNF8;              //  Push-Pull. LED PC8
//	        GPIOC->CRH      &= ~GPIO_CRH_CNF9;              //  Push-Pull. LED PC9
	        GPIOC->CRL      &= ~GPIO_CRL_CNF0;		// LOAD triggering from PC0...
	        GPIOC->CRL      &= ~GPIO_CRL_CNF1;
	        GPIOC->CRL      &= ~GPIO_CRL_CNF2;
	        GPIOC->CRL      &= ~GPIO_CRL_CNF3;		// ... to PC3


//	        GPIOC->CRH   |= GPIO_CRH_MODE8_0;       //  10MHz.
	        										// and where is 9? but works without it... maybe it is unnecessary to set 10MHz? Maybe it's default?
	        GPIOC->CRL   |= GPIO_CRL_MODE0_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE1_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE2_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE3_0;
}


void vTaskLCDdraw(void *pvParameters) {	// draws lcd
//	uint32_t tmp=0;
//	int str;
	for (;;) {
		vTaskSuspendAll();
		Lcd_write_cmd(0x80);	// lcd_goto(0,0)
//		Lcd_goto(0,0);
		Lcd_write_arr(&LCDLine1, 16);
//		xTaskResumeAll();
//		vTaskDelay(15);
//		vTaskSuspendAll();
		Lcd_write_cmd(0x80+0x40);	// lcd_goto(1,0)
		Lcd_write_arr(&LCDLine2, 16);
		xTaskResumeAll();
		vTaskDelay(17);
	}
}


void int32str(uint32_t d, char *out)
{
    out[10] = '\0';
    out[9] = '0' + ( d       )    % 10;
    out[8] = '0' + ( d /= 10 )    % 10;
    out[7] = '0' + ( d /= 10 )    % 10;
    out[6] = '0' + ( d /= 10 )    % 10;
    out[5] = '0' + ( d /= 10 )    % 10;
    out[4] = '0' + ( d /= 10 )    % 10;
    out[3] = '0' + ( d /= 10 )    % 10;
    out[2] = '0' + ( d /= 10 )    % 10;
    out[1] = '0' + ( d /= 10 )    % 10;
    out[0] = '0' + ( d /  10 )    % 10;
//    return out;
}

void int10str(uint32_t d, char *out)
{
    out[4] = '\0';
    out[3] = '0' + ( d       )    % 10;
    out[2] = '0' + ( d /= 10 )    % 10;
    out[1] = '0' + ( d /= 10 )    % 10;
    out[0] = '0' + ( d /  10 )    % 10;
//    return out;
}

uint32_t EE_ReadWord(uint16_t Address){
	uint16_t tmp, tmp2;
	uint32_t Data = 0;
	EE_ReadVariable(Address, &tmp);
	EE_ReadVariable(Address+1, &tmp2);
	Data = ((uint32_t)tmp << 16) + (uint32_t)tmp2;
	return Data;
}

void flush_lcd_buffer(void){
	uint8_t i=0;
	for (i=0;i<16;i++){
		LCDLine1[i]=32;
		LCDLine2[i]=32;
	}
}


void setPwmDc(uint8_t duty_cycle){		// duty_cycle in %
	TIM3->CCR3 = duty_cycle*10;
	TIM3->CCR4 = 1000 - duty_cycle*10;
}

void setDutyCycle(void){
	uint8_t button=0, duty_cycle;
	duty_cycle = TIM3->CCR3/10;
	Lcd_clear();
	while (button!=BUTTON_OK) {
		button = readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("Crnt duty cycle");
		Lcd_goto(1,0);
		Lcd_write_digit(duty_cycle);
		if (button==BUTTON_FWD) {
			if (duty_cycle==99) {
			}
			else {
				duty_cycle++;
				setPwmDc(duty_cycle);
			}
		}
		if (button==BUTTON_BCK) {
			if (duty_cycle==0) {
			}
			else {
				duty_cycle--;
				setPwmDc(duty_cycle);
			}
		}
		vTaskDelay(20);
	}
	Lcd_clear();
}

int main(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	SystemInit();
#ifdef USE_VALVES
	valve_motor_control_init();
	stop_valve_motor(0);
	stop_valve_motor(1);
	stop_valve_motor(2);
	stop_valve_motor(3);
#endif

//	valve_status_updater();
	dosing_motor_control_init();
	enable_dosing_pump(0, 0);
	enable_dosing_pump(1, 0);
	enable_dosing_pump(2, 0);
	enable_dosing_pump(3, 0);
//	close_valve(0,1);
	/* Unlock the Flash Program Erase controller */
	FLASH_Unlock();
	/* EEPROM Init */
	EE_Init();
/*	uint32_t tmp;		// pohodu, nenuzhnoe uzhe. 05.06.2013
	char value[10];
	tmp = EE_ReadWord(0x8000);
	int32str(tmp, &value); */
	AdcInit();
	dht_init();
	uint32_t i;
	for (i=0; i<40000; i++) {}
	Init_lcd();

	water_level_input_init();



#ifdef USE_VALVES
	valve_feedback_init();
#endif

#ifndef PAPA_EDITION
	sonar_init();
#endif

	bluetooth_init();

	buttonCalibration();
	Lcd_clear();



	prvSetupHardware();		// setup gpio for load triggering and led indication
// reinit valves HARDCODE
#ifdef USE_VALVES


#endif

	RtcInit();		//init real time clock

	DSTATUS resp=0;		// variable for status response from sd card init function
	no_sd = disk_initialize(0);		// init card
	if (no_sd==0){
		no_sd = f_mount(0, &fs);
		no_sd = string2log("System started\n", 15);
	}


	Lcd_clear();
	loadSettings();
	flush_lcd_buffer();	// fills the LCD frame buffer with spaces
	xTaskCreate(uart_task,(signed char*)"uart",50,
	            NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(displayClock,(signed char*)"CLK",140,
            NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(timerStateTrigger,(signed char*)"TIMERS",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(plugStateTrigger,(signed char*)"PLUGS",configMINIMAL_STACK_SIZE+35,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(phMonitor,(signed char*)"PHMON",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vTaskLCDdraw,(signed char*)"LCDDRW",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(watering_program_trigger,(signed char*)"WP",configMINIMAL_STACK_SIZE+80,
            NULL, tskIDLE_PRIORITY + 1, NULL);
if (resp==0){
	xTaskCreate(sdLog,(signed char*)"SDLOG",128,NULL, tskIDLE_PRIORITY + 1, NULL);
}

/* Start the scheduler. */

